{
  "url": "https://qiita.com/nokonoko_1203/items/8bafb6033409aadccd9f",
  "content": {
    "text": "Kiroみたいな「仕様書駆動開発」をClaude Code・Opus 4でやるまでの手順を整理した！！！ #LLM - Qiita search search Search Login Signup search Trend Question Qiita Tech Festa Official Event Official Column open_in_new Organization 101 Go to list of users who liked 90 Share on X(Twitter) Share on Facebook Add to Hatena Bookmark more_horiz Delete article close Deleted articles cannot be recovered. Draft of this article would be also deleted. Are you sure you want to delete this article? Cancel Delete delete @ nokonoko_1203 ( のこのこ ) in MIERUNE Kiroみたいな「仕様書駆動開発」をClaude Code・Opus 4でやるまでの手順を整理した！！！ Opus LLM Claude ClaudeCode Kiro Posted at 2025-07-17 Kiro、便利ですねー！ AWS（というかAmazonなのかな？）が本気出してきたなーという感じで、「 仕様書駆動開発 」を謳っており、まずは設計文書を作成し、タスクを整理してから、実装を始める、といったより 実際の開発工程に近いフローでLLMに開発させる ことができます。 何よりロゴが可愛すぎる。 さっそく利用者がたくさんおり、いろんな記事が出ていますが、最初にこんな記事を目にしました。 Claude Codeとの棲み分けなどについても記載されており、大変ありがたなーと思って読ませていただいたんですが、「デメリット」の項目に記載されていたところがやっぱり気になりました。 どうせ、いづれ利用可能になるわけですが、 2025/07現在ではClaude Sonnet 3.7 or 4.0しか利用できず、Opus 4.0 は利用できません。 なので、仕様書などを作成させても、結局はClaude Codeで実装させるーという方がちょこちょこいました。 が！！！！！ であれば 最初からClaude Codeに作業させてもいい んじゃね？？？と思いました。 ちょっと前にこんな記事も書いており、そもそも元から設計やタスク分割をClaude Codeにやらせていたので、Kiroの作成する文章を真似たりして、カスタムコマンドやCLAUDE.mdなどに設定しておけば、他のツールを利用せずに開発を完結させれそうな気もします。 ということで、簡単なツールを作りながら設定ファイルなどを紹介します！ 今回は実装はせず、あくまで事前設計の手順を紹介したいと思います！ （Claude Codeに実装力があるのはみなさんご存知だと思うので！） 設定ファイル まずは、自作した（LLMに作らせた）ファイル群をざっと載せます！ 英語の方が精度が良いとかよく聞くし実際そうだと思うので、設定ファイルは大体英語で書いていきます！ ~/.claude/CLAUDE.md # Guidelines This document defines the project's rules, objectives, and progress management methods. Please proceed with the project according to the following content. ## Top-Level Rules - To maximize efficiency, **if you need to execute multiple independent processes, invoke those tools concurrently, not sequentially** . - **You must think exclusively in English** . However, you are required to **respond in Japanese** . - To understand how to use a library, **always use the Contex7 MCP** to retrieve the latest information. - For temporary notes for design, create a markdown in `.tmp` and save it. - **After using Write or Edit tools, ALWAYS verify the actual file contents using the Read tool** , regardless of what the system-reminder says. The system-reminder may incorrectly show \"(no content)\" even when the file has been successfully written. - Please respond critically and without pandering to my opinions, but please don't be forceful in your criticism. ## Programming Rules - Avoid hard-coding values unless absolutely necessary. - Do not use `any` or `unknown` types in TypeScript. - You must not use a TypeScript `class` unless it is absolutely necessary (e.g., extending the `Error` class for custom error handling that requires `instanceof` checks). ## Development Style - Specification-Driven Development ### Overview When receiving development tasks, please follow the 4-stage workflow below. This ensures requirement clarification, structured design, and efficient implementation. ### 4-Stage Workflow #### Stage 1: Requirements - An",
    "extracted_at": "2025-07-21T15:38:46+09:00"
  },
  "cached_at": "2025-07-21T15:38:46+09:00"
}