{
  "url": "https://qiita.com/akira_papa_AI/items/92fa19cbac0d2918ec8f",
  "content": {
    "text": "【Kiroだけじゃなかった！AWSがAIインフラ続々リリースして凄すぎたので緊急整理🔥】AWSがAIエージェント開発の「実験→本番」への難題を解決！AgentCoreで誰でも本格的なAIエージェントを動かせる時代に突入 #AWS - Qiita search search Search Login Signup search Trend Question Official Event Official Column open_in_new Organization 121 Go to list of users who liked 103 Share on X(Twitter) Share on Facebook Add to Hatena Bookmark more_horiz Delete article close Deleted articles cannot be recovered. Draft of this article would be also deleted. Are you sure you want to delete this article? Cancel Delete delete @ akira_papa_AI ( あきらパパ ) 【Kiroだけじゃなかった！AWSがAIインフラ続々リリースして凄すぎたので緊急整理🔥】AWSがAIエージェント開発の「実験→本番」への難題を解決！AgentCoreで誰でも本格的なAIエージェントを動かせる時代に突入 AWS AI Kiro AgentCore Posted at 2025-07-17 昨日のAWS Summit NYC 2025のキーノート見てて、「これは大きな転換点になるな」って感じたので、整理してシェアしたいと思います。 正直、今までAIエージェントって「デモでは動くけど本番環境では...」みたいなケースが多かったじゃないですか。でも、Amazon Bedrock AgentCoreの発表を見て、ついに実用レベルに到達したなと。 なんでそう思ったのか、順番に説明していきますね。 🤖 Amazon Bedrock AgentCore：AIエージェント実用化の決定版 1. なぜ今までAIエージェントは「デモ止まり」だったのか？ 😅 1.1 プロトタイプは簡単、でも本番は困難の連続 これ、経験ある方も多いと思うんですけど... 開発者の声： 「ローカル環境では完璧に動作するのに...」 セキュリティ担当： 「このエージェント、他のユーザーのデータにアクセスできちゃう可能性はない？」 インフラ担当： 「1人なら動作するけど、1000人同時アクセスになるとシステムが耐えられないかも」 ビジネス側： 「昨日の会話内容を覚えてないの？それじゃ実用的じゃない...」 こんな感じで、PoCフェーズで止まってしまうAIエージェントが本当に多かったんですよね。 1.2 従来ソフトと根本的に違う「エージェントの難しさ」 そもそも、AIエージェントって従来のソフトウェアとは根本的に違うんです。 従来のプログラム： A → B → C（決められた手順を順番に実行） AIエージェント： 「フライト予約して」という目標だけ与える ↓ エージェントが自律的に判断して... ↓ 検索 → 比較 → 予約 → 確認メール送信（全部自動で実行） つまり、動作が動的で予測が難しい。これをセキュアに、スケーラブルに動かすって、相当な技術的チャレンジなんです。 2. AgentCoreが提供する「7つの魔法のツール」 ✨ で、AWSが出してきたAgentCoreがすごいのは、この難しい問題を7つのコンポーネントで包括的に解決しちゃったこと。 2.1 Runtime（実行環境）- 業界最強スペック まず実行環境から。これがもう、今までとは次元が違います。 最長8時間連続実行 （競合は15分程度） 完全セッション分離 （Aさんのデータは絶対にBさんには見えない） 0→1000人を数秒でスケール （サーバー管理不要） 途中で問題が発生しても自動復旧 8時間っていうのは、人間の1日の労働時間とほぼ同じ。つまり、朝から晩まで継続的に作業できるエージェントが作れるってことなんです。 2.2 Memory（記憶）- 人間の脳のような記憶システム これ、本当によく考えられてるなと思いました。 短期記憶： 「今朝はトーストを食べた」みたいな詳細な情報 長期記憶： 「朝食はパン派」みたいな要約された情報 で、すごいのは、 自動で短期記憶から長期記憶へ変換 してくれること。開発者は記憶管理について何も考えなくていいんです。 さらに、複数エージェント間で記憶を共有できるから、営業エージェントが聞いた情報をサポートエージェントも把握してる、みたいな連携が可能になります。 2.3 Identity（認証）- エージェントの身分証明書 セキュリティ面も徹底的に考えられてます。 各エージェントに固有ID発行（なりすまし防止） GitHub、Salesforce、Slackなど主要サービスと簡単連携 「このエージェントは顧客データを読めるけど削除権限はない」みたいな細かい制御 Okta、Microsoft Entra IDとも統合済み これで「権限管理どうしよう...」って悩む必要がなくなりました。 2.4 Browser（ブラウザ）- Web操作の自動化 個人的に一番インパクトがあったのがこれです。 人間と同じようにWebサイトを操作 フォーム入力、ボタンクリック、スクロールなど全ての操作が可能 VM分離による高度なセキュリティ（悪意のあるサイトでも安全） どのAIモデルでも利用可能 （特定のプロバイダーに依存しない） 後で紹介するNova Actと組み合わせると、本当に人間の作業を大幅に効率化できます。 2.5 Code Interpreter（コード実行）- 高度な計算処理 データ分析や複雑な計算が必要な時はこれが活躍します。 例：「去年の売上データを分析して」 → CSVファイル読み込み → Pythonで分析実行 → グラフを自動生成 サンドボックス環境で実行されるから、システムに影響を与える心配もありません。 2.6 Gateway（ゲートウェイ）- API変換器 既存システムとの連携が驚くほど簡単になります。 従来の方法： response = api . get ( ' /inventory/check ' , params = { ' sku ' : ' 12345 ' }) AgentCore利用後： 「在庫を確認して」 Salesforce、JIRA、Zendesk等がワンクリックで連携可能。「顧客情報」って検索したら関連APIが全部出てくるセマンティック検索も便利です。 2.7 Observability（監視）- エージェントの行動ログ 本番運用には絶対に必要な機能ですよね。 「なぜその判断をしたか」が全て可視化される リアルタイムダッシュボード（エラー率、応答時間など） CloudWatch連携で既存の監視体制に組み込み可能 コンプライアンス対応（監査証",
    "extracted_at": "2025-07-28T23:19:01+09:00"
  },
  "cached_at": "2025-07-28T23:19:01+09:00"
}