{
  "url": "https://qiita.com/tomada/items/6a04114fc41d0b86ffee",
  "content": {
    "text": "【仕様駆動開発】cc-sddならKiro式も簡単！Claude Code/Cursor/Gemini CLI に使える国産ツール #cursor - Qiita search search Search Login Signup search Trend Question Qiita Conference Official Event Official Column open_in_new Organization 97 Go to list of users who liked 70 Share on X(Twitter) Share on Facebook Add to Hatena Bookmark more_horiz Delete article close Deleted articles cannot be recovered. Draft of this article would be also deleted. Are you sure you want to delete this article? Cancel Delete delete @ tomada ( とまだ@AI駆動開発 ) in Learning Next 【仕様駆動開発】cc-sddならKiro式も簡単！Claude Code/Cursor/Gemini CLI に使える国産ツール cursor ClaudeCode GeminiCLI Kiro 仕様駆動開発 Last updated at 2025-09-24 Posted at 2025-09-19 こんにちは、とまだです。 みなさん、AWS Kiroの仕様駆動開発（Spec-Driven Development）は試したことあるでしょうか？ 仕様駆動開発は「要件定義→設計→実装」の順番でAIと協働しながら進める開発スタイルです。 ただ、Kiroはウェイトリストに登録しないと使えないし、使えるモデルも限られているんですよね。 今回は、この仕様駆動開発をClaude Codeで実現できる国産ツール「cc-sdd」を実際に使ってみたので、その導入から実践まで詳しく解説します。 （追記：仕様駆動開発の観点を含めて Codex CLI との比較記事も書きました） 忙しい人のために要約 cc-sddは仕様駆動開発をClaude Codeで実現する国産ツール AWS Kiroのスタイルと互換性があり、日本語完全対応 要件→設計→タスク分解→実装の段階的承認フローで品質向上 npx cc-sdd@latest --lang ja の1コマンドで導入可能 既存プロジェクトでもステアリング機能でスムーズに導入可能 Cursor IDEやGemini CLIにも対応 動画でも解説してます！ 仕様駆動開発（Spec-Driven Development）とは？ 従来の開発スタイルの課題 皆さん、Claude Codeで開発をする時にはどのようなスタイルで進めていますでしょうか？ 適当にバイブスコーディングを進めていると、思いつくままに実装してしまい、要件や完成物がブレてしまうという経験はありませんか？ AIが優秀になったからこそ、「とりあえず作って」と伝えると、AIが勝手に判断して進めてしまいます。 その判断がプロジェクトの方向性と合っていればいいのですが、AIはコンテキストの全てを理解しているわけではありません。 その結果、完成してから「思っていたものと違う」となることが多いかもしれません。 これは時間の無駄になるだけでなく、作り直しによるモチベーション低下にもつながります。 仕様駆動開発の流れ 仕様駆動開発は、以下の順序で進めます。 要件定義 ：何を作るか明確にする 設計 ：どう作るか計画する 実装計画 ：タスクに分解する 実装 ：実際にコードを書く この流れのポイントは、各フェーズが独立していることです。 要件を決めてから設計、設計が固まってからタスク分解、という具合に、前のフェーズが完了してから次に進みます。 重要なのは、各フェーズで人間による承認が必要という点です。 この承認プロセスがあることで、AIが独断で進めることを防ぎ、人間の意図を正確に反映できるようになります。 AIが勝手に進めないので、先にあるべき姿（クリア条件）が明確になっています。 そのため、人間もAIも迷わない開発が進められるというメリットがあります。 さらに、仕様書として残るので、後から「なぜこういう実装になったのか」を振り返ることも容易です。 cc-sddの特徴 国産ツールならではの強み cc-sddは日本の開発者が作ったツールです。 日本のエンジニアのニーズを理解した上で設計されています。 具体的な特徴は以下の通りです。 完全日本語対応 ：ドキュメント、コマンド、エラーメッセージすべて日本語 すぐに使える ：ウェイトリスト不要、npmコマンド一発で導入 既存プロジェクト対応 ：ステアリング機能で既存コードを理解してから開始 日本語対応は単に翻訳されているだけでなく、日本語として自然な表現になっています。 エラーメッセージも「何が問題で、どう解決すればいいか」が明確に書かれています。 英語のエラーメッセージを翻訳する手間もありません。 日本の方が開発者なので、ドキュメントは日本語対応されています。 Zennなどの技術プラットフォームでも盛り上がりを見せ始めている状況です。 AWS Kiroとの比較 AWS Kiroとcc-sddの違いを表にまとめました。 それぞれのツールの特徴を比較することで、cc-sddの利点が明確になります。 項目 cc-sdd AWS Kiro 利用開始 即時・無料 ウェイトリスト必要 言語 日本語ネイティブ 英語メイン 使用可能モデル 制限なし 指定モデルのみ cc-sddの大きな利点は、すぐに使い始められることです。 Kiroのウェイトリストに登録して待つ必要がなく、今すぐ仕様駆動開発を試すことができます。 また、使用できるLLMモデルに制限がないため、最新のClaude 3.5 Sonnetなど、好きなモデルを使うことができます。 良い意味で似ています。 Kiroを待たずに同じような開発ができるのは嬉しいですね。 生成される仕様書のフォーマットもKiroと互換性があるため、将来Kiroに移行する際もスムーズです。 一般的に認知されている Kiro の仕様駆動開発の流れとも同一ですので、違和感なく使えました。 Kiroのドキュメントや記事を読んだことがある方なら、すぐに理解できるはずです。 インストールと初期設定 基本的なインストール手順 インストールは簡単です。 プロジェクトのルートディレクトリで以下のコマンドを実行するだけです。 npx cc-sdd@latest --lang ja このコマンドは、デフォルトでClaude Code対応の設定をインストールします。 --lang ja オプションで日本語モードを有効にします。 実行時の注意点として、以下を確認してください。 CLAUDE.md の上書き確認が出るので、既存の CLAUDE.md がある場合",
    "extracted_at": "2025-09-30T10:37:06+09:00"
  },
  "cached_at": "2025-09-30T10:37:06+09:00"
}