{
  "url": "https://ascii.jp/elem/000/004/312/4312173/",
  "content": {
    "text": "ASCII.jp：無料の動画生成AI「Wan2.2」が凄すぎる　PCローカルでこの品質が出せるとは (1/5) このページの本文へ ASCII.jp AI トップ AI IoT ビジネス TECH Web Pro デジタル iPhone/Mac ホビー 自作PC AV アキバ スマホ スタートアップ VR ウェアラブル ゲーム ASCII倶楽部 アスキーキッズ 格安SIM 家電ASCII アスキーグルメ アスキーストア 週刊アスキー TeamLeaders プログラミング+ HealthTech Sports FinTech レジャー＆ ショッピング 地域 innovation SDGs 地方活性 PC 富士通 DELL mouse iiyamaPC ドスパラ Sycom Acer パソコン SEVEN MSI FRONTIER LAVIE Lenovo ゲーミングPC STORM Razer ASUS HP Digital ELECOM AMD ASUS ROG GIGABYTE Samsung SSD ASRock Crucial HUAWEI Xperia HTC CITIZEN Smart Watch ViewSonic Belkin Business 弥 生 JAWS Acrobat kintone Azure LINE WORKS 名人 シリーズ Google Cloud SORACOM Dropbox CData Backlog Fortinet ヤマハ Special マカフィー ダイドー キヤノンMJ DMMGAMES イノラボ JAPANNEXT ソフマップ brand new ME! 前へ 1 2 3 4 5 次へ 新清士の「メタバース・プレゼンス」 第119回 無料の動画生成AI「Wan2.2」が凄すぎる　PCローカルでこの品質が出せるとは 2025年08月11日 07時00分更新 文● 新清士 シェア ツイートする 一覧 アリババの動画生成モデル「Wan2.2 14B」i2vを使い、明日来子さん（この連載によく登場する作例キャラクター）に銃を構えさせた動画の一部（筆者作成） 　7月28日に公開された中国・アリババの動画生成AIモデル「 Wan2.2 」がすさまじい性能を発揮しています。ローカルPC環境で利用できるオープンモデルとして公開されましたが、ヘタな商用AIクラウドサービスを超えていると感じさせるほど、高品質なAI動画が生成可能です。2月リリースの「Wan2.1」でも高い評価を得ていましたが、それを遥かに超えており、業界を席巻しそうな雰囲気を感じました。 ※記事配信先の設定によっては図版や動画等が正しく表示されないことがあります。その場合はASCII.jpをご覧ください 実写もアニメも高性能 　Wan2.2の性能の高さは触れば触るほどわかってきます。カップ麺、箸、麺など、複数のオブジェクトが関わるため、画像や動画生成AIでは一般的に苦手といわれてきたテーマであっても、破綻なく描写ができます。対象物との関係性が問われる銃を撃つアクションをさせてみましたが、こうした課題も見事に乗り越えています。どちらも、過去この連載で作成した作例モデルキャラの「明日来子さん」を最初の画像に指定して、i2v（Image-to-Video、画像からビデオ）により生成しています。 △明日来子さんが、カップラーメンとハンバーガーを食べている動画。作成はWan2.2　I2V-A14B（後述）を使用。効果音は動画に合わせて任意の音を付けてくれる「MMAudio」で作成（以下、同じ） △明日来子さんが、銃とライフルを構えて発砲する動画。撃った後にニヤリとしたり、背後の人が振り返って見ているのは、プロンプトで指定している 　実写系だけでなく、アニメ系など、画風が異なるものでも描写力は高いです。複雑なプロンプトを認識できるようで、対象物、動き、美的なニュアンス、ライティングを詳しく記述すると、それに合わせて忠実に動画が生成されます。プロンプトは英語と中国語で記述する必要がありますが、公式なアナウンスはされていないものの、日本語も認識します。ただしプロンプトとしては、ネイティブ言語の中国語が最も効果が大きいという報告もあります。 △アニメ・イラスト系の作例いろいろ。ベース画像はMidjourneyで作成し、Wan2.2 I2V-A14Bを使用し、832x480で作成 前へ 1 2 3 4 5 次へ ツイートする カテゴリートップへ この連載の記事 第118回 AI AIの「ASMRボイス」に脳ゾワゾワ　合成音声の進化と、収益化への課題 第117回 AI “18禁”美少女AI「Ani」は孤独を癒すか、深めるか？ 第116回 AI AIが書いた怪談小説が面白い　2分に1本のペースで出力されるのは驚異的 第115回 AI “一貫性”がすごい画像生成AI　冬服→夏服も一発変換　話題の「FLUX.1 Kontext[dev]」 第114回 AI Midjourneyの動画生成AIが強い　驚きの高性能で価格破壊 第113回 AI AI丸投げのゲーム開発が超楽しい　誰もがプログラムを作る時代は確実に来る 第112回 AI 楽曲生成AIの進化が凄い　鼻歌からプロ級の曲がポンポンできる 第111回 AI 画像生成AI、日本の開発者コミュニティが熱い　世界最先端の “新手法”続々 第110回 AI グーグルの動画生成AI「Veo 3」が圧倒的、だけど高すぎ 第109回 AI ChatGPTの“彼女”と大げんかして、Geminiに乗り換えた この連載の一覧へ この記事の編集者は以下の記事をオススメしています AI Midjourneyの動画生成AIが強い　驚きの高性能で価格破壊 AI “一貫性”がすごい画像生成AI　冬服→夏服も一発変換　話題の「FLUX.1 Kontext[dev]」 AI “残念じゃない美少女イラスト”ができた！　お絵描きAIツール4選【アニメ絵にも対応】 AI ChatGPTの性格が変わったと悲鳴あがる「GPT-4oを返して！」 Apple イーロン・マスク氏、アップル責める　OpenAI以外が1位にならないのは違法として訴訟も示唆 AI xAI「Grok 4」期間限定で無料に　OpenAI「GPT-5」対抗か トピックス 最大25％還元！ PayPay自治体キャンペーン大量追加【2025年10月分】 AIオススメ記事 2025年08月11日 AI 無料の動画生成AI「Wan2.2」が凄すぎる　PCローカルでこの品質が出せるとは 2025年07月18日 AI 無料で「Gemini 2.5 Pro」が使える！グーグル「Gemini CLI」の使い方を簡単解説 2025年08月04日 AI “残念じゃない美少女イラスト”ができた！　お絵描きAIツール4選【アニメ絵にも対応】 2025年08月08日 AI OpenAIのローカルAIを無料で試す　RTX 4070マシンは普通に動いたが、M1 Macは厳しかった… 2025年07月14日 AI “一貫性”がすごい画像生成AI　冬服→夏服も一発変換　話題の「",
    "extracted_at": "2025-08-13T13:20:06+09:00"
  },
  "cached_at": "2025-08-13T13:20:06+09:00"
}