{
  "url": "https://dev.classmethod.jp/articles/claude-code-superclaude/",
  "content": {
    "text": "Claude Codeに専門家チームを追加！開発効率を向上させるSuperClaudeを試してみた | DevelopersIO produced by Classmethod AWS Bedrock CDK Security Hub Organizations Google Cloud 生成AI MCP セキュリティ モダンデータスタック セミナー 会社説明会 事例 目次 はじめに SuperClaudeを使うメリット ペルソナによる自動最適化 高品質なスラッシュコマンドがすぐに使える 実際に使ってみる 動作環境 インストール手順 実際にコマンドを使ってみる 自然言語での会話でもペルソナが活用される まとめ 付録：アンインストール手順 1. SuperClaudeの完全アンインストール 2. 残存ファイルの削除 3. CLAUDE.mdの復元 参考リンク Claude Codeに専門家チームを追加！開発効率を向上させるSuperClaudeを試してみた # Claude Code # Claude # 生成AI 鈴木純 2025.07.25 はじめに 皆さん、Claude Codeは使っていますでしょうか。私はプライベートでもMaxプランを契約して、もう手放せない存在になってしまいました。 とても便利なツールですが、使い込んでいくうちに細かく設定したい項目が増えてきます。CLAUDE.mdの書き方、カスタムスラッシュコマンドの追加など、検討する項目も多くなってきているのではないでしょうか。 今回は、そうした悩みを解消できそうなOSSフレームワーク「 SuperClaude v3 」（以下、SuperClaude）を試してみました。SuperClaudeは、Claude Codeをさらに効率的に活用できるよう拡張してくれるツールです。 GitHubのリポジトリはこちらです。 https://github.com/SuperClaude-Org/SuperClaude_Framework ! 注意 : SuperClaude v3は初期リリースしたばかりのため、予期しない動作やバグが発生する可能性があります。 まだ使い込んではいませんが、まずは試してみようと思い、実際に使ってみました。 インストールは1分程度で完了しますし、アンインストール手順も記事の最後に記載していますので、ぜひ皆さんも気軽に試してみてください。 SuperClaudeを使うメリット SuperClaudeを導入することで、以下のようなメリットがあります。 ペルソナによる自動最適化 SuperClaudeの最大の特徴は、 「ペルソナ」と呼ばれる専門家の役割 が自動的に起動することです。これは、フロントエンド開発、セキュリティ、パフォーマンス最適化など、各分野の専門家がClaude Codeの中に存在しているような体験を提供してくれる機能です。まるで専門家チームに作業を依頼しているような感覚で開発を進めることができます。 現時点（2025年7月25日）では以下のペルソナが利用可能です。 ペルソナ 専門分野 🏗️ architect システム設計・長期アーキテクチャ 🎨 frontend UI/UX・アクセシビリティ・デザインシステム ⚙️ backend API・インフラ・信頼性エンジニアリング 🛡️ security 脅威モデリング・脆弱性評価 ⚡ performance 最適化・ボトルネック特定 🔍 analyzer 根本原因調査・体系的デバッグ 🧪 qa テスト戦略・品質保証 🔄 refactorer コード品質・技術的負債管理 🚀 devops インフラ自動化・デプロイ 👨‍🏫 mentor 教育指導・知識移転 ✍️ scribe 専門的文書作成・コミュニケーション これらのペルソナは、タスクの内容を分析して自動的に選択され、場合によっては複数のペルソナが連携して作業を行ってくれます。コマンドを明示的に使用しない場合でも、SuperClaudeがタスクの内容を分析して適切なペルソナを自動的に起動してくれるため、Claude Code自体の応答精度が向上し、より的確なサポートを受けることができます。 ペルソナに関する詳細情報は、以下ユーザーガイドで確認してください。 SuperClaude Personas User Guide 高品質なスラッシュコマンドがすぐに使える さらに、開発で頻繁に利用するスラッシュコマンドが高いクオリティですぐに使える点も大きな魅力です。現時点（2025年7月25日）で利用可能なコマンドは以下のとおりです。各コマンドに、上記の専門家ペルソナが適切に割り当てられます。 コマンド 目的 最適な用途 /sc:analyze コード解析 問題発見、コードベース理解 /sc:build 自動ビルド コンパイル、バンドル、デプロイ準備 /sc:implement 機能実装 機能、コンポーネント、API、サービス作成 /sc:improve コード改善 リファクタリング、最適化、品質修正 /sc:troubleshoot 問題調査 デバッグ、問題調査 /sc:test テスト実行 テスト実行、カバレッジ分析 /sc:document ドキュメント作成 READMEファイル、コードコメント、ガイド作成 /sc:git Git作業支援 効率的なコミット、ブランチ管理 /sc:design システム設計支援 アーキテクチャ計画、API設計 /sc:explain 学習支援 概念学習、コード理解 /sc:cleanup 技術的負債削減 デッドコード除去、ファイル整理 /sc:load プロジェクト理解 プロジェクト分析、コードベース理解 /sc:estimate 工数見積もり 時間/工数計画、複雑性分析 /sc:spawn 複雑作業管理 マルチステップ操作、ワークフロー自動化 /sc:task プロジェクト管理 長期機能計画、タスク追跡 /sc:workflow 実装計画 PRDからのステップバイステップワークフロー作成 /sc:index コマンド検索 タスクに適したコマンド発見 開発で必要となる主要なコマンドは一通り揃っています。これらを自分で用意するのは大変なので、用意されているのは助かりますね。 なお、各コマンドの詳細な使い方については、以下のユーザーガイドで確認できます。 SuperClaude Commands Guide 他にもPlaywrightなどのMCPサーバーが統合されていたり、トークンの最適化などがありますが、ここでは主要な機能はスラッシュコマンドとペルソナにあるため省略します。 気になる方は README.md を参照してください。 実際に使ってみる それでは、実際にSuperClaudeをインストールして使ってみましょう。 動作環境 今回使用した環境は以下のとおりです。 Python 3.8以上（今回は3.12を使用） Claude Code インストール手順 1. uvのインストール まず、Pythonのパッケージマネージャー「uv」がインストールされていない場合は、以下のコマンドで",
    "extracted_at": "2025-07-28T16:51:17+09:00"
  },
  "cached_at": "2025-07-28T16:51:17+09:00"
}