{
  "url": "https://qiita.com/zazen_inu/items/be6accceb5f808d52bc8",
  "content": {
    "text": "Claude Codeを「第二の自分」にする、Obsidianを脳として。 #AIエージェント - Qiita search search Search Login Signup search Trend Question Qiita Conference Official Event Official Column open_in_new Organization 155 Go to list of users who liked 144 Share on X(Twitter) Share on Facebook Add to Hatena Bookmark more_horiz Delete article close Deleted articles cannot be recovered. Draft of this article would be also deleted. Are you sure you want to delete this article? Cancel Delete delete flag AI時代の相棒は、キミに決めた！ 推しのAIエージェントをシェアしよう！ @ zazen_inu ( 座禅いぬ ) Claude Codeを「第二の自分」にする、Obsidianを脳として。 Obsidian AIエージェント DeepResearch ClaudeCode コンテキストエンジニアリング Last updated at 2025-09-05 Posted at 2025-08-26 こんばんは。座禅いぬです。 Claude Code、Gemini CLI、CursorにKiroと、いよいよ AIエージェントのない生活など考えられなくなってきましたね 。最初は何ができるんだろう？と思いながら触っていましたが、自分なりの仕組みができてくるにつれすっかり生活必需品。「我々は道具を形づくり、その後、道具が我々を形づくる。」という有名な言葉がありますが、まさに生活を劇的に変えているなあと思います。 ここしばらく、日々の業務において経営分析や調査業務の効率化が急務となっていました。各種AIツールを連携させることで一定の効率化は実現できていましたが、それでもまだ十分とは言えませんでした。先月半ばにLT会などでも発表しましたが Obsidianをコンテキスト倉庫としたより自律的な運用の必要性を痛感 していました。 また、そのような中で、 GeminiCLIをmarkdownで制御してDeep Researchを再現してみようぜ というチャレンジを行ったのですが、このような仕組みを使えばvault内を調査して、RAGよりも柔軟に情報取得してコンテキストを引っ張ってこれる可能性を感じました。 そこで、Claude Codeなどのような コーディングエージェントを、より汎用的なリサーチや分析業務・経営などに応用できないか と考え、AIエージェントとの「協働」による新しい業務自動化の検証を行っています。 AIエージェントに「仕事をさせる」とはどういうことだろう AIエージェントに単純作業を「自動化」させるだけでは、人間の代替に過ぎません。変な話、 人間でもできる仕事しかしていない という意味でもあり、新規性はないです。しかし、もし 自分自身の思考や判断プロセスをエージェントに移植し、「自分を複製」することができれば、そこには独自の価値が生まれる はずです。なんとかしたいですよね。 その鍵となるのが、「 連続性 」と「 自律性 」です。つまり、常に人間の意図や文脈（コンテキスト）を理解し、それに沿って自律的に判断・実行できるエージェントがあれば、 今までの自動化の文脈とは違う新しい価値が生まれます 。 仮説：厳密なルールが、コンテキストに沿った自律性を生む AIエージェントに人間のような柔軟な判断を期待するのはまだ難しいのが現状だと思いますが、それは 連続性がないから判断の収束する場所が見えないがゆえ のことではないかと思います。今のLLM、もう十分すぎるほど賢いですよね。人間でこんなに賢い人はそうそういないなあと思います。 それを踏まえて、「 厳密なルールを課すことで、コンテキストに沿った自律性を実現できるのではないか 」という仮説を立てました。 作業のプロセスを「入力 → 状況・制約の参照 → 基準参照 → 意思決定 → 実行 → 責任と検証」と分解し、各段階でエージェントが従うべきルールを定義します。これにより、人間の判断をシミュレートさせようという試みです。これって、最近のエージェントが 要件定義や仕様、タスクリストをきっちり定義するとコード生成がうまくいきやすいのと同じ ことですよね。 検証：ルールベースのAIエージェント運用 今回は、ユーザー知見の多いClaude Codeエージェントを用いて、以下のルールを定義し、実際の業務で検証を行いました。 1. 厳密なルールセットの定義 エージェントの挙動を制御するため、 CLAUDE.md というファイルに以下のルールを記述しました。 スケジュール管理 : 毎朝、その日のタスクを30分単位のスケジュールに分解する。人間は各コマの開始前に計画を承認する。 進捗管理 : タスクが完了したら、スケジュール表のチェックボックスを更新し、実績を記録する。人間の承認なしには次のタスクに進めない。 自律的なコンテキスト検索 : タスク実行に必要な情報は、ObsidianのVault内から自律的に検索・参照する。 情報提供依頼書 : 必要な情報が見つからない場合、人間に「情報提供依頼書」を生成し、追記を求める。 調査依頼書 : 外部情報の調査が必要な場合、Deep Research（ChatGPTなど）にそのまま投入できる形式の「調査依頼書」プロンプトを生成する。 この仕組みにより、「 AIが自律的に作業し、人間は要所で承認と方向修正を行う 」という協働体制を目指します。これはポモドーロテクニックと併用して、人間が自分の作業に25分集中し、5分の休憩時にレビューするというサイクルを回すことを想定しています。 というか僕が歯医者なので、普段こんな感じで仕事をしているというだけではあります。 2. 実際に検証 この仕組みを、仕事やプライベートで使い倒すこととしました。 事例1 解決したい課題 マナビDXクエストで、みんながコーディングの勉強を気軽にできる自主イベントを開催したいなあ。なんかええアイディアないかなあ。せや！自分たちの学習を補助してくれるツールを開発するイベントはどやろ？ ClaudeCodeに依頼 課題解決のプロセスを相談→タスクをスケジュールに割り振る ClaudeCodeがvault内を調査し、調査依頼書を生成する wikilinkでドキュメントがまとめられているので、しゅっと参照できます。 ChatGPT Deep Researchに調査依頼書をコピペして調査 対話や調査、時には差戻しを繰り返しスライド作成まで終了 受講生コミュニティってないけど、まあいいか。最後の25分仮眠してたからこんなもん。でも内容は（寝ぼけて検印",
    "extracted_at": "2025-09-30T10:36:19+09:00"
  },
  "cached_at": "2025-09-30T10:36:19+09:00"
}