{
  "url": "https://zenn.dev/acntechjp/articles/c558ca0d83ca88",
  "content": {
    "text": "Claude Code最新のカスタムサブエージェント機能を試してみた Accenture Japan (有志) Accenture Japan (有志) Publication Pro 📝 Claude Code最新のカスタムサブエージェント機能を試してみた Hongbo.Ding 2025/07/26 に公開 Claude アクセンチュア AIエージェント Claude Code tech はじめに 近日、Anthropic社がClaude Codeに新機能「カスタムサブエージェント」を追加しました。早速この機能を試してみることにしました。 これまでもClaude CodeにはTask toolを使ったサブエージェント機能がありましたが、今回の更新により、ユーザーが自分の用途に合わせてサブエージェントを自由にカスタマイズ・作成できるようになりました。実際に使ってみると、これは単なる機能拡張ではなく、AIアシスタントとの協働方法を根本的に変える可能性があると感じました。 https://docs.anthropic.com/en/docs/claude-code/sub-agents カスタムサブエージェントとは 基本概念の理解 サブエージェントは、特定のタスクに特化したClaude Codeの軽量インスタンスです。それぞれが独立したコンテキストウィンドウを持ち、専門的な役割を担当します。 実は、Claude CodeにはTask toolを使ったサブエージェント機能が以前から存在していました。しかし、これまでは内部的に定義された汎用的なサブエージェントしか利用できませんでした。今回のアップデートの画期的な点は「カスタマイズ性」です。ユーザーが自分のニーズに合わせて、専門的なサブエージェントを自由に設計・作成できるようになったのです。 仕組み ClaudeCodeのサブエージェントは以下の特徴があります： 並列実行 ：複数のサブエージェントを同時実行可能 効率的な実行 ：タスクの特性に応じた最適な処理 独立したコンテキスト ：各サブエージェントが独自のコンテキストウィンドウを保持 柔軟なツールアクセス ：必要なツールのみを選択的に付与可能 実際に作成してみる それでは、実際にカスタムサブエージェントを作成する流れを見ていきましょう。 ステップ1：コマンドの実行 まず /agents コマンドを入力します： ステップ2：保存場所の選択 プロジェクト固有にするか、全プロジェクトで使えるようにするかを選択します： ステップ3：作成方法の選択 Claudeに自動生成してもらうか、手動で設定するかを選びます。今回は推奨されている自動生成を選択しました： 自動生成の場合は、プロンプトをClaudeにあたって、サブエージェントを作成してもらうということです。 ステップ4：エージェントの説明 今回は「プロジェクト構造を分析して、ツリー形式で可視化するエージェント」を作成してみました： プロンプト： プロジェクト構成のスキャンおよびドキュメント整理に特化したアシスタントです。プロジェクトのディレクトリ構成を自動的に解析し、分かりやすく標準化された構成ドキュメントを生成します。大規模なコードベースの構造把握や、ファイルディレクトリの整理、ツリー形式での構成図作成、各モジュールの役割説明などが必要な場合に優先的にご利用ください。プロジェクトの階層構造を的確に解析し、各機能モジュールを分類、ディレクトリツリーと役割コメントを出力し、ドキュメントの標準化やチーム開発の効率化をサポートします。 Claudeが自動的に設定を生成してくれます： ステップ5：ツールの選択 サブエージェントに使わせるツールを選択します。全ツールを使わせることも、必要最小限に絞ることも可能です： 作成が完了すると、サブエージェントのリストに追加されます： 設定ファイルの構造 生成された設定ファイルは以下のような構造になっています： --- name : project - structure - analyzer description : プロジェクトのディレクトリ構造を分析・文書化するエージェント tools : Read , Glob , LS , Grep --- You are a Project Structure Analysis Expert , specializing in scanning , analyzing , and documenting software project architectures. # Core Responsibilities: 1. **Automated Structure Scanning** : You systematically traverse project directories ... 2. **Directory Tree Generation** : You create clear , hierarchical representations ... # 以下省略 また、作成したサブエージェントを修正することも可能です。 実際に使ってみた プロジェクト構造の分析 作成したサブエージェントを実際に使ってみました。個人プロジェクトの構造を分析してもらいます： サブエージェントが自動的に起動し、分析を開始します： 分析結果 PROJECT_STRUCTURE.md ファイルが生成されました： 生成されたツリー構造の一部を見てみると、各ファイルの役割が日本語でコメントされています： 効果の分析 実際に使ってみて、以下の点が特に印象的でした： プロジェクトの技術スタックを自動認識（Python、CLI、データベースツールなど） 各ファイルの役割を適切に判断し、わかりやすい日本語でコメント 階層構造を保ちながら、重要な情報を強調 従来の方法では、こうした分析を手動で行うか、複雑なプロンプトを書く必要がありましたが、専用のサブエージェントを作成することで、簡単な指示だけで高品質な結果を得られるようになりました。メインコンテキストに影響しないのが重要！ コミュニティリソース claude-agentsプロジェクト 自分でサブエージェントを作成するのも楽しいですが、コミュニティが作成したものを使うのも効率的です。例えば、他のユーザーが作成した claude-agents は、様々なサブエージェントを集めたオープンソースプロジェクトです。 https://github.com/iannuttall/claude-agents 提供されているサブエージェント： コードリファクタリング コンテンツライティング支援 フロントエンド設計 プロダクト要件定義書作成 プロジェクトタスク計画 セキュリティ監査 コーディング指導 インストール方法 使い方は簡単で、リポジトリから必要なエージェントをコピーするだけです： # プロジェクト固有で使う場合 cp -r claude-agents/agents/* .claude/agents/ # 全プロジェクトで使う場合 cp -r claude-age",
    "extracted_at": "2025-11-13T15:31:22+09:00"
  },
  "cached_at": "2025-11-13T15:31:22+09:00"
}