{
  "url": "https://codezine.jp/article/detail/21917",
  "content": {
    "text": "AWS、AI駆動開発を支援するIDE「Kiro」を発表 仕様駆動により保守性を向上|CodeZine（コードジン） メールアドレス パスワード パスワードを忘れた場合はこちら ログイン ※旧SEメンバーシップ会員の方は、同じ登録情報（メールアドレス＆パスワード）でログインいただけます ニュース 記事 デブサミ・デブスト 書籍 サイト内 検索 ログイン 新規 会員登録 ログイン 新規会員登録 メールバックナンバー 寄稿・取材企画募集 広告掲載のご案内 ニュース GitLab Duoエージェントプラットフォームのベータ版が追加された「GitLab 18.2」リリース 新着記事一覧 LaravelのInertia＋Vueの組み合わせでフロントエンド的な画面を作成する【基本編】 テーマから記事を探す アプリケーション開発 現場と上流の往復で見つけた「構造」という武器──アーキテクト 尾髙敏之さんが語る、事業目線の育て方 アーキテクトは「価値」と「勝ち」を設計する──アーキテクト 米久保剛さんが語る、技術とビジネスをつなぐ思考 インフラ Amazon Aurora DSQLがついにGA！プレビュー版からの違いを徹底解説 SREの腕試し！ 障害対応力を問う「現場あるある」を詰め込んだPagerDuty Challenge Cupレポート データテクノロジー 【超時短テクニカルライティング】生成AIを活用しながら文章を見直して、よりわかりやすい文章にしよう 生成AIをフル活用！「Amazon Bedrock」の注目アップデート【AWS re:Invent 2024 エンジニア向けまとめ】 開発プロセス AIエージェント時代にも変わらない\"エンジニアの本質\"とは？──どこまでAIに任せ、どこで人間が介入するのか 「プロジェクトマネジメントの基本」の先に待つ、現場で起こる成功と失敗を歴戦のPM達が語る エンジニア組織 【成長するための1on1完全攻略術】エンジニアが1on1をリードするファーストステップ 技術で組織に貢献する「参謀」──スタッフエンジニアが拓くキャリアの可能性 プロダクト開発 スタートアップでQAチームをゼロから築いた3年──1人目QAが学んだ「個→チーム→組織」成長の法則 なぜあなたのWebサイトは遅いのか？ mizchi氏が語るパフォーマンス改善のポイントとは 連載から探す 連載記事 LivewireとInertiaによるLaravelのフロントエンド的画面作成入門 Livewireを使ってフロントエンド的な画面を作成する ITエンジニア注目トレンドを総まとめ！週間ニュースランキング ITエンジニア注目トレンドを総まとめ！週間ニュースランキングTOP10【7/18～7/24】 開発生産性向上に寄与するツール大研究 「言った・言わない」からエンジニアを守る！ AI議事録サービス「LINE WORKS AiNote」が開発現場にもたらす価値 翔泳社 新刊紹介 データに合わせたバックアップの方法を解説 『実務で役立つバックアップの教科書』発売 Developers Summit 2025 セッションレポート 失敗から学ぶテスト自動化——5つの課題を乗り越えた成功への道のり 翔泳社の本 NewSQLとは何か？　SQL（RDBMS）やNoSQLとの違いと「いいとこどり」の特徴をマンガで解説 執筆者一覧 イベント Developers Summit 2025 Summer 講演資料まとめ Women Developers Summit 2025 講演資料まとめ Developers Summit 2025 講演資料まとめ Developers CAREER Boost 2024 講演資料まとめ Developers X Summit 2024 講演資料まとめ Developers Summit 2024 KANSAI 講演関連資料まとめ CodeZine BOOKS 8/31までサンプルコードを募集！ 翔泳社40周年企画の日めくりカレンダー『コードサンプル365+1』に掲載 Kindleで技術書が50％オフのサマーセール開催　8/7まで翔泳社の本が対象 ゲーム制作、何もかも初めての人に贈る入門書　『たのしい2Dゲームの作り方 第3版』発売 エンジニアも知っておきたいUIの改善点がひとめでわかる　『今すぐ使える「UIデザイン」41の法則』 NewSQLとは何か？　SQL（RDBMS）やNoSQLとの違いと「いいとこどり」の特徴をマンガで解説 品質をあらゆる面から検証せよ！ シフトレフトを実現するフルスタックテスティングの全体像 ニュース 記事 アプリケーション開発 インフラ データテクノロジー 開発プロセス エンジニア組織 プロダクト開発 プログラミング 事例 イノベーション デブサミ・デブスト 書籍 寄稿・取材企画募集 広告掲載のご案内 CodeZineについて メールバックナンバー ヘルプ 著作権・リンク 会員情報管理 免責事項 会社概要 サービス利用規約 プライバシーポリシー 外部送信 テーマから探す 連載から探す 新着記事一覧を見る 寄稿・取材企画募集 アプリケーション開発 現場と上流の往復で見つけた「構造」という武器──アーキテクト 尾髙敏之さんが語る、事業目線の育て方 インフラ Amazon Aurora DSQLがついにGA！プレビュー版からの違いを徹底解説 データテクノロジー 【超時短テクニカルライティング】生成AIを活用しながら文章を見直して、よりわかりやすい文章にしよう 開発プロセス AIエージェント時代にも変わらない\"エンジニアの本質\"とは？──どこまでAIに任せ、どこで人間が介入するのか エンジニア組織 【成長するための1on1完全攻略術】エンジニアが1on1をリードするファーストステップ プロダクト開発 スタートアップでQAチームをゼロから築いた3年──1人目QAが学んだ「個→チーム→組織」成長の法則 プログラミング 【TypeScriptの基礎を学ぶ】JavaScriptと比較して起こりがちなミスを防ごう！ 事例 「三菱電機を芯からアジャイルに」三菱電機の中の人になった市谷氏×20年のアジャイル推進者 細谷氏と紐解く大企業DXのヒント イノベーション オープンソースで自動運転開発？ ティアフォーが語る「自動運転×Web技術」開発のリアルと技術スタック 連載記事 LivewireとInertiaによるLaravelのフロントエンド的画面作成入門 Livewireを使ってフロントエンド的な画面を作成する ITエンジニア注目トレンドを総まとめ！週間ニュースランキング ITエンジニア注目トレンドを総まとめ！週間ニュースランキングTOP10【7/18～7/24】 開発生産性向上に寄与するツール大研究 「言った・言わない」からエンジニアを守る！ AI議事録サービス「LINE WORKS AiNote」が開発現場にもたらす価値 翔泳社 新刊紹介 データに合わせたバックアップの方法を解説 『実務で役立つバックアップの教科書』発売 Developers Summit 2025 セッションレポ",
    "extracted_at": "2025-07-28T16:51:14+09:00"
  },
  "cached_at": "2025-07-28T16:51:14+09:00"
}