{
  "url": "https://zenn.dev/beagle/articles/bc6ef88dd68615",
  "content": {
    "text": "Claude Code on the webを触ってみた びーぐる 🐩 Claude Code on the webを触ってみた 2025/10/31 に公開 2025/11/10 AI Claude Anthropic Claude Code Coding agent tech びーぐるです🐶 2025年10月21日、Anthropic社が提供するAIモデルClaudeを利用したAIコーディングエージェント Claude Code on the web がリサーチプレビューとして公開されました。 https://www.anthropic.com/news/claude-code-on-the-web このサービスはクラウド型AIコーディングエージェントと呼ばれるもので、ブラウザやiOSのアプリから直接アクセスできる手軽さが特徴です。 現時点ではAndroidアプリ版からは利用できないようです…残念。 本記事では、Claude Code on the webを実際にセットアップし、試してみます。 本当にただ触っただけの記事になりますが、ご了承ください。 後日の記事ではAnthropic社の参入で一層注目されつつあるクラウド型AIコーディングエージェントについて考察したいと思います。 ! 10月31日にグループ えーあいみーとあっぷ！ のオフラインイベント「Claude Code on the web 会」が開催されます。 参加条件として、 何かしらの成果物を作って来た方のみ とありますので、この記事を読んで作成すれば参加条件を満たせます。 まだ若干名参加枠が残っているようですので、興味のある方はぜひ参加をご検討ください。 私も参加します。 https://aimeetup.connpass.com/event/373363/ 更新情報 2025/10/31 投稿しました 2025/11/09 Hit and Blowアプリケーションを更新し、修正や追加指示に関する説明を追加しました Claude Code on the web(CC on the web)とは？ 冒頭で説明した通り、Anthropic社が提供するクラウド型AIコーディングエージェントです。 現在リサーチプレビューのベータ版であり、ProおよびMaxプランのユーザーが利用可能です。 ブラウザからは以下のURLからアクセスできます。 https://claude.ai/code また、詳細なドキュメントは以下にあります。 https://docs.claude.com/en/docs/claude-code/claude-code-on-the-web 以下、長いので CC on the web と略します。 クラウド型AIコーディングエージェントとは？ クラウド型AIコーディングエージェントとは、その名の通り クラウド上で動作するAIコーディングエージェント のことを指します。 一般的にAIコーディングエージェントといえば、Claude CodeのようなCLIツール、GitHub CopilotのようなIDEプラグイン、もしくはCursorのようにIDE自体として提供されているのを思い浮かべるかと思います。 クラウド型のAIコーディングエージェントは、これらとは異なり環境構築やインストールやセットアップが不要で、ブラウザやアプリから直接利用できる手軽さがあります。 主要なモデルプロバイダーからはOpenAIのCodex(Cloud), GoogleのJulesが提供されており、その他DevinやReplit等、多数のサービスが存在します。 当然、慣れ親しんだターミナルの補完性能やIDEの機能は利用できませんが、どこからでもスマホ一つでアクセスできる利便性は魅力でしょう。 CC on the webの導入方法 当然ながら、すでに各サービスのアカウントを持っている場合はそのまま利用可能です。 また、Claudeの他のサービスで既にGitHubアカウントを連携している場合は、一部のプロセスを省略できるはずです。 GitHubアカウントを作成 CC on the webを利用するためには、GitHubの利用が必須です。 https://github.com/ Anthropicのアカウントを作成し、ProまたはMaxプランに加入 最安のProプランは月額20ドルです。 https://claude.ai/code にアクセスし、Connect to GitHubボタンからアカウントと連携 Claudeのトップページのサイドバーから &lt;/&gt;コード というメニューを選択して連携画面へ進むこともできます。 GitHubにClaudeアプリをインストール 以下のURLにアクセスし、リポジトリにアクセスできるようにClaudeアプリをインストールします。 一度インストールすれば、以後新規作成したリポジトリであっても自動的に利用可能になります。 https://github.com/apps/claude これで完了です。あとはチャット欄に指示を入力するだけで、コードの生成や修正、説明等を行ってくれます。 詳細な機能や仕様について 実際に利用する前に、知っておくと良いことをいくつか紹介します。 利用制限 CC on the webは、アカウント内の他のすべてのClaudeサービスと利用制限を共有しています。 CLIのClaude Codeと同様です。 タスクの並列実行 CC on the webでは、複数のタスクを並列で実行できます。 リポジトリAの作業を指示したあと、終わる前にリポジトリBの作業を指示することが可能です。 当然のことながら、複数のタスクを並行して実行すると利用制限に到達するまでの時間が早まりますので、使い所には注意が必要です。 セキュリティ CC on the web内の各セッションは、独立してAnthropic社管理のバーチャルマシン上で実行されます。 各タスクごとにクラウド上のサンドボックスが用意されると考えれば良いでしょう。 ネットワークアクセスはデフォルトで信頼できる最低限のドメインのみに制限されています。 また、GitHub操作は専用のプロキシを用いて行われ、安全な操作が保証されています。 当然、突如メインブランチを上書きするような暴挙は許されていません。 高いセキュリティが確保されているため、企業内のコードベースであっても安心して利用できる設計となっているということです。 その他の事項 CC on the webの詳細な仕様については、以下のドキュメントに詳しく記載されています。 https://docs.claude.com/en/docs/claude-code/claude-code-on-the-web 実際に使ってみた1 - Vibe Codingでヒットアンドブロー では、実際にCC on the webを使ってみましょう。 私が最初にVibe Codingの企画に参加した際に作成させたのが ヒットアンドブロー でした。 https://zenn.dev/beagle/articles/b",
    "extracted_at": "2025-11-13T15:31:23+09:00"
  },
  "cached_at": "2025-11-13T15:31:23+09:00"
}