{
  "url": "https://iret.media/169031",
  "content": {
    "text": "毎朝30分かかってたタスク整理、3分になっちゃった話 &#8211; Claude Code × MCP × Obsidian による究極の自動化術 &#8211; | iret.media share facebook facebook facebook x x logo menu clp_logo hatena pocket slack アイレットが運営する情報満載のオウンドメディア ALL エンジニアブログ イベントレポート アイレットのこと クラウドのこと 注目コンテンツ 事例インタビュー ALL エンジニアブログ イベントレポート アイレットのこと クラウドのこと 注目コンテンツ 事例インタビュー 著者一覧 iret.media について メールマガジン登録 #AWS #Google Cloud #Azure #セキュリティ #New Relic #PagerDuty #Amazon S3 #Lambda #EC2 #Docker #Terraform #Python #人事 #広報通信 #inside UI/UX #UX #デザイン #Vue.js #React #Typescript #javascript #HTML #CSS #AI #生成AI #Amazon Bedrock #Gemini #Vertex AI トップ エンジニアブログ 毎朝30分かかってたタスク整理、3分になっちゃった話 - Claude Code × MCP × Obsidian による究極の自動化術 - 毎朝30分かかってたタスク整理、3分になっちゃった話 &#8211; Claude Code × MCP × Obsidian による究極の自動化術 &#8211; 後藤 和貴 エンジニアブログ 2025.09.24 x facebook はてなブックマーク pocket #Claude Code #MCP #obsidian #業務効率化 #生成AI #生成AIイチオシ こんにちは、アイレット後藤です。 さて、みなさん。朝、PC を開いて最初にやることって何ですか？ 私の場合、これまでは毎朝30分以上かけて、メールチェック、Slack 確認、カレンダー確認、Notion のタスク整理、Backlog の課題確認・・・と、あちこちのツールを行き来していました。 これ、今の自分の役割が広がり複雑化してきているためコントロールしづらく、正直、非常に大変でした。 でも今は違います。「おはよう」の一言で、すべてが3分で完了します。 今回は、Claude Code と MCP サーバーを活用した、新しいタスク管理の仕組みをご紹介します。実際に使ってみて、非常に効果的でしたので共有させていただきます。 なぜ生成 AI によるタスク管理が必要だったのか 情報が散らばりすぎ問題 現代の、特に IT に関わる現場で働く人が抱える大きな課題のひとつは「情報の分散」だと思います。 私の場合はこんな状況です： メール ：個人宛と チーム宛（広報、パートナーアライアンス）の複数アカウント Slack ：複数チャンネルに散在するメンション、DM、重要メッセージ カレンダー ：Google Calendar に散在する会議、締切、リマインダー タスク管理 ：Notion と Backlog に分かれた個人とチーム、そしてプロジェクトのタスク これらを毎朝手動で確認して優先度を整理するのは、作業負荷が高すぎます。さらに、人間である以上、見落としや判断ミスも避けられません。 これは自動化するしかないと感じました。 既存ツールじゃダメだった理由 既存のタスク管理ツールやカレンダーアプリも試してみました。Remember the Milk、Wunderlist、Todoist、Trello、Google Tasks など様々なものを使いました。 しかし、どれも「単一のプラットフォーム内での管理」に留まっていて、複数のシステムを横断した統合的な管理はできませんでした。 生成 AI の登場により発想を転換し、AI の「情報統合力」と「優先度判断力」を活用してタスク管理を行うことにしました。 システム全体像：5つの情報源を1つのログに 開発したシステムの全体像は、実はシンプルです： 主要コンポーネント Claude Code ：Anthropic 社の公式 CLI ツール。最新の Claude Opus 4.1 モデルを活用します MCP サーバー ：各種 API と Claude Code を接続するブリッジです 情報源 API ：Gmail、Google Calendar、Notion、Backlog、Slack Obsidian ：最終的なデイリーログの出力先（ローカル環境で完結） 技術的な仕組み：MCP サーバーと CLAUDE.md の魔法 MCP（Model Context Protocol）サーバーってなに？ MCP は Anthropic が開発したプロトコルで、生成 AI と外部サービスを連携させるための標準化された仕組みです。MCP サーバーは、このプロトコルに準拠したサーバープログラムで、Claude Code から各種 API へのアクセスを仲介します。 今回の用途に応じて、以下の MCP サーバーを選定・設定しました： 活用している MCP サーバー Gmail MCP サーバー メールの検索、読み取り、送信、ラベル管理など Gmail の主要機能にアクセス。OAuth 認証を利用してセキュアに接続します。 Google Calendar MCP サーバー カレンダーイベントの取得、作成、更新が可能。複数カレンダーの統合ビューや空き時間検索にも対応しています。 Notion MCP サーバー Notion データベースやページへの API アクセスを提供。タスク管理やドキュメント作成の自動化に活用できます。 Backlog MCP サーバー プロジェクト管理ツール Backlog の課題やプルリクエスト、Wiki などにアクセス。日本の開発現場でよく使われるツールとの連携を実現します。 Slack MCP サーバー チャンネル一覧、メッセージの検索・投稿、スレッド操作など Slack の主要機能を網羅。リアルタイムのコミュニケーション情報を統合できます。 これらのサーバーは ~/.claude.json などに設定を記述することで（または claude mcp add コマンド）、Claude Code から利用可能になります。各サーバーには適切な認証情報（APIキー、OAuthトークンなど）の設定が必要です。 CLAUDE.md によるカスタマイズの効果 MCP サーバーへの接続設定が整ったら、実際に指揮するのがプロジェクトディレクトリに置いた CLAUDE.md です。 ここで「どんな入力を受けたら」「どの情報源から」「どの順番で」データを集めるか、そして最終的なログの構造までを細かく規定して試してみたところ、これが非常に効果的でした。 重要なのは、すべての処理が手元の会社 PC で実行されるため、認証情報や機",
    "extracted_at": "2025-09-30T10:37:06+09:00"
  },
  "cached_at": "2025-09-30T10:37:06+09:00"
}