{
  "url": "https://japan.zdnet.com/article/35235610/",
  "content": {
    "text": "Anthropic、「Claude Code」の分析ダッシュボードを提供--利用状況やROIなど可視化 - ZDNET Japan Continue to ZDNET Japan 特集 海外発 業界DX 製造 流通 教育 CIO/経営 ITインフラ セキュリティ クラウド データマネジメント ソフトウェア Special 広告特集：新しいセキュリティのカタチ 読者調査 2025：「働く場所の自由」と「Wi-Fiリスク」 新着まとめ：未知・未管理資産が招くインシデント ZDNET United States ZDNET France ZDNET Germany ZDNET Korea Go --> Go 新規登録 ログイン FAQ My ページ ログアウト FAQ マーケティング クライアント オフトピ アーカイブ 特集 海外発 業界DX 製造 流通 教育 CIO/経営 ITインフラ セキュリティ クラウド データマネジメント マーケティング ソフトウェア クライアント オフトピ アーカイブ 広告特集：新しいセキュリティのカタチ ZDNET Japan ソフトウェア Anthropic、「Claude Code」の分析ダッシュボードを提供--利用状況やROIなど可視化 Sabrina Ortiz&nbsp;（ZDNET.com）&nbsp;翻訳校正：&nbsp;編集部 2025-07-17 07:58 シェア Tweet noteで書く 印刷する メールで送る テキスト HTML 電子書籍 PDF ダウンロード テキスト 電子書籍 PDF クリップした記事をMyページから読むことができます Here's my content 　Anthropicは、ユーザーのプライバシー保護と高度なコーディング機能という2つの主要な強みを背景に、業界内で際立った存在となっている。特に、ユーザーがワークスペース内で直接コーディングアシスタントを活用できる「Claude Code」は、コードの記述や管理を支援する機能が高く評価され、爆発的な勢いでユーザー数を伸ばしている。現在では、非常に需要の高い機能として定着している。 　Anthropicは米国時間7月15日、Claude Code向けに包括的な分析ダッシュボードを公開した。このダッシュボードにより、企業の管理者はチームがAIコーディングツールをどのように活用しているかを詳細に把握できるようになる。具体的には、ユーザーごとのアクティビティーの内訳やコストの追跡など、より深い洞察が得られる仕組みとなっている。 提供：Anthropic 　この分析ダッシュボードは、「Anthropic API」を通じてClaude Codeを利用しているすべてのチームに対して、デフォルトで有効化される。これにより、管理者はツールの使用状況をより正確に理解し、最も重要な点として、投資対効果（ROI）を適切に評価するための判断材料を得られる。 　Claude CodeチームのマネージャーであるAdam Wolff氏は米ZDNETに対し、「このソリューションにあまり多くの費用をかけたくないのは当然だ。モデル自体がかなり高価なので、費用もかさむ可能性がある」と述べる。一方で、「同時に、その費用を過小評価すべきではない。なぜなら、多くの面で、このシステムに投入する1ドルは、それ以上の価値を生むと考えているからだ」とも語っている。 　このダッシュボードには、承認されたコード行数、総費用、時間経過に伴うユーザーアクティビティー、提案の採用率などの指標が表示される。これらのデータは、管理者がツールの利用状況やワークフローの変化を正確に把握するために役立つ。 　Wolff氏はまた、「このダッシュボードは、開発者の生産性に基づいて罰則や報酬を与えるためのものではない」と強調している。むしろ、エンジニアリング部門内で何が機能し、何が機能していないのかを共有し、理解を深めることを目的としているという。 　Claude Codeは、「Claude 4」モデルのローンチ以降、急速に成長しており、ユーザーベースは300％増加、年間売上高は5.5倍以上に拡大している。Anthropicはさらに、Claude CodeにおけるリモートMCPサポートの導入や、月額20ドルのProプランにClaude Codeを含めるなど、継続的に新機能を展開している。 提供：Anthropic / Elyse Betters Picaro / ZDNET この記事は海外Ziff Davis発の 記事 を朝日インタラクティブが日本向けに編集したものです。 ZDNET Japan 記事を毎朝メールでまとめ読み（登録無料） メールマガジン登録のお申し込み シェア Tweet noteで書く 関連記事 ソフトウェアテスト自動化におけるAI活用の5つのトレンド 「Googleスプレッドシート」、AI関数を導入--セルにプロンプトを直接入力 「Linux」でWindowsアプリを実行するには--「Wine」を使用した手順 AIのDeep Researchを使い比べ--ChatGPT、Gemini、Perplexity、Grokの違いは？ Anthropicの「Claude」、外部アプリや外部サイトとの連携が可能に AIに店舗の運営を1カ月間任せたらどうなるか？--Anthropicが結果を発表 Anthropic、「Claude」でAIアプリを構築・共有可能に--「Artifacts」機能を強化 Anthropic、日本進出を発表--Claude日本語版をリリース AIエージェントが保身のために人間を脅迫することがある--Anthropicが報告 関連キーワード 生成AI 人工知能（AI） 関連ホワイトペーパー アジャイル開発推進企業が語る、開発生産性の向上に向けた課題とその成果とは？ 開発生産性の可視化で企業はどう変わったか、大手企業3社のベストプラクティスをご紹介 プルリクのリードタイムを1/5に劇的改善。DMM.comの開発生産性向上への取り組みとは？ 組織拡大に伴う課題を解決するカギは「開発生産性」、可視化と自律的な改善文化の実践例を紹介 人気カテゴリ 経営 セキュリティ クラウドコンピューティング 仮想化 ビジネスアプリケーション モバイル 特集 カーボンニュートラル（脱炭素） 持続可能な地域社会を目指す「地域DX」 さまざまなLinuxディストリビューションの世界 トップインタビュー 松岡功の「今週の明言」 トランスフォーメーションの破壊者：インテントAI 松岡功の一言もの申す Linuxノウハウ 「GIGAスクール構想」で進化する教育現場 PDF Report at ZDNET Japan パスキー徹底解説：パスワードレスな未来への完全ガイド デジタルジャーニーの歩き方 DMARC導入待ったなし！ ビジネスアジリティー向上：ビジネスのスピードアップを図ろう 流通テック最前線 デジタル岡目八目 ICT来し方行く末 中国ビジネス四方山話 Ziddyちゃんの「私を社食に連れてって」 「ひとり情シス」の本当のところ DXで直面するカベ",
    "extracted_at": "2025-07-28T23:19:03+09:00"
  },
  "cached_at": "2025-07-28T23:19:03+09:00"
}