{
  "url": "https://zenn.dev/mixi/articles/5310ae6203511e",
  "content": {
    "text": "Kiroにspecを作らせてClaude Codeに実装させる Zenn MIXI DEVELOPERS Tech Blog MIXI DEVELOPERS Tech Blog Publication Pro 📑 Kiroにspecを作らせてClaude Codeに実装させる しろちゃん 2025/07/25 に公開 AI AWS Anthropic Claude Code Kiro tech ! この記事は人間が書きました。 はじめに こんにちは Kiroが話題になりすでに色々と検証して使った方も多いと思います。 私もリリース当日に触っていたのですが、話題になりすぎて途中からClaude Sonnet 4.0がビジー状態で使えなくなったためしばらく使用を控えていました。 https://x.com/shirochange/status/1946102620797780269 Kiroのブームも落ち着いてきている様子だったのでこのタイミングでようやく本格的に検証をしています。 実際にKiroに関するブログ記事やSNSを見ていると実装計画を立てるフロー(spec)をほめているのをよく目にしました。 実際にKiroにspecを作らせてこれはなかなかすごいなと感じていました。 ですが一方でKiroに実際にコードを書かせるとなると実装スピードという部分で物足りなさがありました。 特にClaude Codeを利用していると私と同様にKiroでの実装は少し物足りない部分がある方もいらっしゃるのではないでしょうか？ そこで今回の検証では、 Kiroにはspecを作ってもらう部分を担当してもらう。 そのspecを元にClaude Codeが実装をする。 と言った流れを試してみました。 今回は以下のリポジトリを実験場としています。 https://github.com/shirochan/task-tool すでに同様の取り組みをされている方もいらっしゃると思いますがご了承ください。 実際にKiroを使う前にこちらの記事をご覧いただければ嬉しいです。 https://zenn.dev/shirochan/articles/331d0ecac815ce Kiroフェーズ specを作ってもらう specを作るフローでは以下の3つのマークダウン形式のファイルが作成されます。 要件定義書(requirement.md) 設計書(design.md) 実装タスクリスト(tasks.md) 今回はUI/UXの観点に絞った改善案を考えてもらいました。 UI/UX改善案 🎨 UI/UX改善案（ローカル環境特化） 現在のコードを分析した結果、以下のUI/UX改善案を提案します： 1. 情報密度とレイアウトの最適化 現在の問題点： タスクカードが縦に長く、一覧性が低い 週間スケジュールが固定高さで使いにくい タブ切り替えで情報が分断される 改善案： ダッシュボード型レイアウト: タスク一覧とスケジュールを同時表示 コンパクトビュー: タスクカードの情報密度を調整可能 サイドバー導入: ナビゲーションとクイックアクション用 グリッドレイアウト: カスタマイズ可能なウィジェット配置 2. インタラクション改善 現在の問題点： フォーム表示でモーダルが画面を占有 ドラッグ&amp;ドロップの視覚的フィードバックが弱い キーボード操作への対応不足 改善案： インライン編集: タスクの直接編集機能 クイック追加: ヘッダーに常時表示の簡易入力フィールド キーボードショートカット: 全操作のキーボード対応 ジェスチャー対応: スワイプでタスク操作（タッチデバイス） 3. 視覚的階層とフィードバック 現在の問題点： 優先度の視覚的区別が弱い 進捗状況が分かりにくい 時間情報の表示が不十分 改善案： カラーコーディング: 優先度・ステータス別の統一カラーシステム プログレスバー: タスク進捗の視覚化 タイムライン表示: 時系列での作業履歴表示 アニメーション: 状態変更時のスムーズな遷移 4. コンテキスト情報の充実 現在の問題点： タスクの関連情報が見えにくい 作業時間の把握が困難 過去の履歴が活用されていない 改善案： 情報パネル: 選択タスクの詳細情報を常時表示 時間トラッキング: リアルタイム作業時間表示 関連タスク表示: 類似・関連タスクの自動表示 統計ウィジェット: 今日/今週の進捗サマリー 5. レスポンシブ・アダプティブデザイン 現在の問題点： デスクトップ環境での画面活用が不十分 モバイル表示での操作性 ウィンドウサイズ変更への対応 改善案： マルチカラム対応: 大画面での効率的レイアウト 折りたたみ可能パネル: 必要に応じた情報の表示/非表示 ズーム対応: 表示倍率の調整機能 ウィンドウ分割対応: 複数ウィンドウでの同時作業 6. パーソナライゼーション 現在の問題点： 固定的なレイアウト 個人の作業スタイルに合わせられない テーマ設定が基本的すぎる 改善案： カスタマイズ可能ダッシュボード: ウィジェットの自由配置 ワークスペース: 用途別の画面レイアウト保存 詳細テーマ設定: カラー・フォント・サイズの細かい調整 表示密度設定: コンパクト/標準/ゆったりモード 7. フィードバックとガイダンス 現在の問題点： エラーメッセージが簡素 初回利用時のガイダンス不足 操作結果のフィードバックが弱い 改善案： トースト通知: 操作結果の即座フィードバック オンボーディング: 初回利用時のインタラクティブガイド ツールチップ: 機能説明の充実 ヘルプシステム: コンテキスト依存のヘルプ表示 8. パフォーマンス最適化 現在の問題点： 大量タスク時の表示遅延 スケジュール表示の重さ 不要な再レンダリング 改善案： 仮想スクロール: 大量データの効率表示 遅延読み込み: 必要な時のみデータ取得 キャッシュ戦略: 頻繁アクセスデータの最適化 プリロード: 予測される操作の事前準備 🎯 実装優先度 Phase 1: 基本UX改善 インライン編集機能 キーボードショートカット トースト通知システム カラーコーディング統一 Phase 2: レイアウト改善 サイドバー導入 ダッシュボード型レイアウト 情報パネル レスポンシブ改善 Phase 3: 高度なUX カスタマイズ可能ダッシュボード オンボーディング アニメーション パフォーマンス最適化 これらの改善により、ローカル環境での長時間使用に適した、効率的で使いやすいタスク管理ツールに進化させることができます。 どの改善案から実装を始めたいか、または特定の機能について詳細な設計を検討したいものがあれば、お知らせください。 要件定義書(requirement.md) https://github.com/shirochan/task-tool/blob/main/.kiro/specs/ui-ux-improvements/requirements.md 設計書(design.md) https://github.com/shirochan/task-tool/blob/main/.ki",
    "extracted_at": "2025-07-28T16:51:09+09:00"
  },
  "cached_at": "2025-07-28T16:51:09+09:00"
}