{
  "url": "https://zenn.dev/xtm_blog/articles/d8085c176f0040",
  "content": {
    "text": "自然言語でワークフロー作成？Claude Code、n8n、n8n-mcpを組み合わせた開発体験レポート Zenn クロステックマネジメント（京都芸術大学） クロステックマネジメント（京都芸術大学） Publicationへの投稿 🤖 自然言語でワークフロー作成？Claude Code、n8n、n8n-mcpを組み合わせた開発体験レポート saicologic 2025/08/14 に公開 2025/08/17 1 件 n8n Model Context Protocol Claude Claude Code tech はじめに こんにちは！R&amp;DチームでAI関連のリサーチを担当しています。最近のAI技術の進歩スピードには本当に驚かされますよね！毎日のように新しいツールやアップデートが登場しています。 そんな中、最近取り組んでいるのがn8nを使ったワークフロー自動化の仕組み作りです。n8nはノーコードでワークフローを構築できる便利なツールなのですが、従来は手動でワークフローを組み立てる必要がありました。 ところが、Claude Codeとn8n-mcpを組み合わせることで、とても便利なことができるようになったんです。AIに自然言語で指示するだけで、自動的にワークフローを作成してくれました。さらに、追加の質問や修正依頼をすると、リアルタイムでワークフローを更新してくれる機能まで備わっています。 この面白い開発体験をぜひ皆さんにも味わっていただきたいので、今回はその具体的な方法をご紹介したいと思います。 1. ワークフロー更新が劇的に楽になった 以前：AIが生成したJSONコードを手動でn8nにインポート 今：Claudeとチャットするだけで自動更新！ 従来の面倒な インポート作業 をしなくて良くなりました！ 2. 知らないサービス連携を発見できる 「こんなことがしたい」と伝えると、AIが最適なインテグレーションを選んでくれます。膨大な n8nの連携サービス の中から、自分では思いつかなかった組み合わせを提案してくれるので、「あ、こんな方法があったのか！」という学びが多いですね！ 3. AIへの指示の仕方でワークフローが変わる 質問の仕方によって全く違うワークフローが生成されることがわかりました！ 例1：「チャットボットを作って」と伝えた場合 Webhook受信 → AI Agent → レスポンス返却のシンプルなフロー 例2：「ユーザーとAIが対話できるシステムを作って。会話履歴も保存したい」 Webhook → データベース保存 → 会話履歴取得 → AI Agent → レスポンス保存 例3： 「Slackで人とAIが会話できるようにして」 Slack Trigger → AI Agent -&gt; Slack返信 求める機能の詳細や使用場面を具体的に伝えることで、AIが提案するアーキテクチャが大きく変えてくれます。この体験を通じて、要件定義の重要性とAIとのコミュニケーション方法の両方を学ぶこともできます。 AIがワークフローを自動生成！実際に体験してみよう Claude Code + n8n + n8n-mcpの組み合わせを、実際に試す方法をご紹介します。ローカル環境で簡単にセットアップできるので、ぜひ体験してみてくださいね！ Claude Code、n8n、そしてn8n-mcpを組み合わせることで、これまでにない柔軟性と効率性を持つワークフロー自動化が実現できます。 今回は、この強力な3つのツールを連携させる具体的なセットアップ手順をご紹介します。ローカル環境での構築は思っているより簡単で、数ステップで動作環境を整えることができます。 AIアシスタントとワークフロー自動化の新しい可能性を、まずはお手元の環境で実際に触れて体感してみましょう！ 準備するもの 必要なソフトウェア Terminal https://support.apple.com/ja-jp/guide/terminal/welcome/mac Claude Code https://docs.anthropic.com/ja/docs/claude-code/overview n8n-mcp https://github.com/czlonkowski/n8n-mcp n8n https://docs.n8n.io/hosting/installation/docker/#prerequisites 設定方法 AIが発した指示が、n8n-mcpというツールを通じて、実際に動作するn8nワークフローへと自動変換される仕組みを構築していきます。この連携により、自然言語でのリクエストが即座に実行可能な自動化プロセスとして実現されます。 以下の手順で、段階的にセットアップを進めていきましょう。 セットアップ手順 Step 1: Claude Codeのインストール Claude Codeの導入は、公式の セットアップガイド に従って進めてください。 主要な手順： Claude Codeのダウンロード・インストール Anthropic APIキーの設定 動作確認 詳細なインストール手順や環境別の設定方法については、上記の公式ドキュメントで最新の情報をご確認いただけます。各OS（Windows、macOS、Linux）に対応したインストール方法が丁寧に解説されています。 Step 2: n8nのインストールと起動 データ永続化用ボリュームの作成 データ永続化用ボリュームの作成 まず、n8nのデータを保存するためのDockerボリュームを作成します： docker volume create n8n_data n8nの起動 以下のコマンドでn8nを起動します。Dockerイメージがローカルに存在しない場合は、初回実行時に自動的にダウンロードされます： docker run -it --rm --name n8n -p 5678:5678 -v n8n_data:/home/node/.n8n docker.n8n.io/n8nio/n8n このコマンドにより、n8nがポート5678で起動し、作成したワークフローやデータがボリュームに永続化されます。 管理画面へのアクセス n8nが正常に起動したら、ブラウザで http://localhost:5678 にアクセスして管理画面を開きます。 Step 3: n8n-mcpのセットアップ インストール方法 n8n-mcp の公式QuickStartガイドでは、複数のインストール方法が紹介されています。ドキュメントにはClaude Desktop向けの設定例が多く掲載されていますが、ここではClaude Codeでの活用を想定した設定手順をご紹介します。 お使いの環境や用途に応じて、最適なセットアップ方法を選択してください。 Docker Install docker pull ghcr.io/czlonkowski/n8n-mcp:latest 引用元 n8nの設定手順 n8nでAPIキーを生成する手順は以下の通りです： n8nの管理画面で、左下のアイコンをクリック Setti",
    "extracted_at": "2025-08-23T14:24:56+09:00"
  },
  "cached_at": "2025-08-23T14:24:56+09:00"
}