{
  "url": "https://note.com/npaka/n/nfb92cca5c8aa",
  "content": {
    "text": "Claude の Connectors Directory の概要｜npaka ログイン 会員登録 Claude の Connectors Directory の概要 41 npaka 2025年7月15日 09:04 以下の記事が面白かったので、簡単にまとめました。 ・ Browsing and Connecting to Tools from the Directory 1. Connectors Directory 「 Connectors Directory 」は、「Claude」の機能を拡張できる推奨ツールを厳選したコレクションです。これらのツールを使用することで、「Claude」はお気に入りのアプリやサービスに接続し、データにアクセスし、ユーザーに代わってアクションを実行できます。 【注意】 リモートコネクタは、「Claude Pro」「Max」「Team」「Enterprise」プランのユーザーが利用できます。ローカルデスクトップ拡張機能は、無料プランのユーザーを含むすべてのユーザーが利用できます。 2. 利用可能なコネクタの参照 「Connectors Directory」は、以下の2つの場所から参照できます。 ・チャットから (1) チャットUIの左下の「検索とツール」をクリック。 (2)&nbsp;メニューから「コネクタを追加」を選択。 (3)&nbsp;利用可能なコネクタを確認。 ・設定から (1) 「設定 → コネクタ」を選択。 (2)&nbsp;「コネクタを参照」をクリック。 (3)&nbsp;利用可能なコネクタを確認。 このディレクトリには、以下のコネクタが含まれています。 ・生産性向上ツール Asana、Notion、Linear、Atlassian ・コミュニケーションツール Intercom ・開発者ツール Sentry、Cloudflare ・ビジネスツール Stripe、PayPal、Square、Plaid ・自動化ツール Zapier ・デスクトップ拡張機能 ファイルシステムアクセス、iMessage、その他のデスクトップ拡張機能 3. Claude をツールに接続 ディレクトリから Claude をツールに接続するには、以下の手順に従います。 (1) 追加するコネクタをクリック。 (2)&nbsp;コネクタの説明と機能を確認。 (3)&nbsp;「接続」または「インストール」をクリックして、セットアッププロセスを開始。 (4)&nbsp;認証プロンプトに従って、「Claude」にアカウントへのアクセスを許可。 必要に応じて、特定の設定や権限を設定します。 【重要】 ツールに接続すると、アカウントの権限に基づいて、「Claude」にそのサービス内のデータへのアクセスと、場合によってはデータの変更を許可することになります。信頼できるツール、かつワークフローに必要なツールのみに接続してください。 4. 接続したツールの使用 接続すると、会話でツールが利用できるようになります。 (1) チャットインターフェースで「検索とツール」メニューを探す。 (2) 「Claude」がその会話で使用したいツールを有効にする。 (3) 「Claude」は、リクエストに応じてこれらのツールを呼び出すことができるようになる。 例えば、「Linear」に接続した後、「Claude」に「ログインバグに関する新しい課題を作成」するように依頼すると、「Claude」は「Linear」ツールを使用してワークスペースに課題を作成します。 5. 接続済みツールの管理 接続済みツールを管理する手順は、次のとおりです。 (1) 「設定 → コネクタ」を選択。 (2) 「コネクタ」 セクションで、接続済みのすべてのツールを確認。 ツールごとに、次の操作を実行できます。 ・ツールを完全に切断。 ・接続設定を変更。 ・権限とアクセスレベルの確認。 6. セキュリティに関する考慮事項 セキュリティに関する考慮事項は、次のとおりです。 ・権限を慎重に確認する 接続プロセス中に、ツールが要求するアクセス権限を確認してください。 ・信頼できるツールを使用する ディレクトリには、当社の品質基準を満たす推奨ツールが含まれています。 ・ツールの使用状況を監視する 「Claude」がツールに対してどのような操作を行っているかに注意してください。 ・必要に応じてアクセスを取り消す 不要になったツールや使用していないツールを切断します。 7. 接続に関する問題のトラブルシューティング 接続に関する問題のトラブルシューティングは、次のとおりです。 ・インターネット接続の確認 安定した接続を確保してください。 ・アカウントアクセスの確認 サービスに有効なアカウントがあることを確認してください。 ・権限の確認 ツールによっては、特定の権限やアカウントの種類が必要な場合があります。 ・再接続を試す 認証に失敗した場合は、接続を切断してから再接続してみてください。 8. カスタムコネクタ ディレクトリコネクタに加えて、カスタムコネクタも追加できます。 (1)「設定 → コネクタ」で、「カスタムコネクタを追加」を探す。 (2)&nbsp;コネクタの名前とURLを入力。 (3)&nbsp;ディレクトリコネクタと同じ接続手順に従う。 【重要】 カスタム統合により、「Claude」を「Anthropic」によって検証されていないサービスに接続できるようになります。信頼できる組織のサーバのみに接続し、認証権限を慎重に確認してください。 やさしいMCP入門 www.amazon.co.jp 1,426 円 (2025年07月15日 09:03時点 詳しくはこちら) Amazon.co.jpで購入する ダウンロード copy いいなと思ったら応援しよう！ チップで応援する #生成AI #Claude #AIエージェント #mcp #Anthropic 41 npaka フォロー プログラマー。iPhone / Android / Unity / ROS / AI / AR / VR / RasPi / ロボット / ガジェット。年2冊ペースで技術書を執筆。アニソン / カラオケ / ギター / 猫 twitter : @npaka123 noteプレミアム note pro よくある質問・noteの使い方 プライバシー クリエイターへのお問い合わせ フィードバック ご利用規約 通常ポイント利用特約 加盟店規約 資⾦決済法に基づく表⽰ 特商法表記 投資情報の免責事項",
    "extracted_at": "2025-07-21T15:38:55+09:00"
  },
  "cached_at": "2025-07-21T15:38:55+09:00"
}