{
  "url": "https://aws.amazon.com/jp/blogs/news/introducing-kiro/",
  "content": {
    "text": "Kiro のご紹介 – プロトタイプからプロダクションまで、あなたと共に働く新しい Agentic IDE | Amazon Web Services ブログ Skip to Main Content アマゾン ウェブ サービスのホームページに戻るには、ここをクリック AWS について お問い合わせ サポート&nbsp; 日本語&nbsp; アカウント&nbsp; サインイン AWS アカウントを作成 製品 ソリューション 料金 ドキュメント 学ぶ パートナーネットワーク AWS Marketplace カスタマーサポート イベント その他 閉じる عربي Bahasa Indonesia Deutsch English Español Français Italiano Português Tiếng Việt Türkçe Ρусский ไทย 日本語 한국어 中文 (简体) 中文 (繁體) 閉じる 自分のプロフィール AWS Builder ID からサインアウト AWS マネジメントコンソール アカウント設定 請求情報とコスト管理 セキュリティ認証情報 AWS Personal Health Dashboard 閉じる サポートセンター エキスパートによるサポート ナレッジセンター AWS サポートの概要 AWS re:Post アマゾン ウェブ サービスのホームページに戻るには、ここをクリック 無料で開始する お問い合わせ 製品 ソリューション 料金 AWS 入門 開始方法 ドキュメント トレーニングと認定 デベロッパーセンター お客様の導入事例 パートナー AWS Marketplace サポート AWS re:Post コンソールにログイン モバイルアプリをダウンロード ブログホーム カテゴリ&nbsp; エディション&nbsp; 閉じる アマゾン ウェブ サービス (AWS) ブログ AWS スタートアップ ブログ AWS パートナーネットワーク ブログ 閉じる English Edition 中国版 Édition française Deutsche Edition 日本版 한국 에디션 Edição em português Edición en español Версия на русском Edisi Bahasa Indonesia Amazon Web Services ブログ Kiro のご紹介 – プロトタイプからプロダクションまで、あなたと共に働く新しい Agentic IDE by 稲田大陸 on 15 7月 2025 in Announcements , Developer Tools , DevOps Permalink Share 本記事は米国時間 7 月 14 日に公開された「 Introducing Kiro – A new agentic IDE that works alongside you from prototype to production 」の日本語抄訳版です。Kiro の最新情報は、 https://kiro.dev/ をご覧ください。 こんな経験はありませんか。何度もプロンプトを入力すると、動作するアプリケーションができあがる。楽しくて魔法のように感じます。しかし、プロダクション環境に移行するには、それだけでは不十分です。アプリケーションを構築する際、AI モデルはどのような前提を置いたのでしょうか？あなたはずっとエージェントをガイドしてきましたが、それらの決定は文書化されていません。要件は曖昧で、アプリケーションがそれらを満たしているかどうかわかりません。システムがどのように設計され、その設計があなたの環境とパフォーマンスにどう影響するかをすぐに理解できません。時には一歩下がって決定事項を整理することで、より良くて保守しやすいアプリケーションにたどり着くことがあります。それが Kiro が仕様駆動開発で支援することです。 コンセプトからプロダクションまで、AI エージェントとの作業を簡素化した開発者体験を通じて開発を支援する AI IDE（統合開発環境）、Kiro の発表を嬉しく思います。Kiro は Vibe Coding “も” 得意ですが、それをはるかに超えています。Kiro の強みは、スペック (spec) やフック (hook) などの機能を使って、これらのプロトタイプをプロダクションシステムに移行することです。 Kiro スペック (spec) は、機能を深く考える必要がある時、事前計画が必要なリファクタリング作業、システムの動作を理解したい時など、プロダクションに移行するために必要なほとんどの場面で有用な成果物です。開発を始める時、要件は通常不明確なので、開発者は計画と明確化のために仕様を使用します。仕様は同じ方法で AI エージェントをより良い実装に導くことができます。 Kiroフック (hook) は、あなたが見落としたことをキャッチしたり、作業中にバックグラウンドで定型業務を完了する経験豊富な開発者のように機能します。これらのイベント駆動による自動化は、ファイルの保存、作成、削除時、または手動トリガーでエージェントにバックグラウンドタスクを実行させます。 スペックとフックを使った開発 Kiro は仕様ワークフローを開発とより統合することで加速します。この例では、手作り品販売の e コマースアプリケーションに、ユーザーが各商品にフィードバックを残すためのレビューシステムを追加したいと思います。spec を使った開発の 3 ステップのプロセスを見てみましょう。 私たちが取り組んでいる e コマースアプリ 1. 単一プロンプトから要件へ Kiro は単一プロンプトから要件を展開します。「製品のレビューシステムを追加」と入力すると、レビューの表示、作成、フィルタリング、評価というユーザーストーリーが生成されます。各ユーザーストーリーには、開発者が基本的なユーザーストーリーから構築する際に通常処理するエッジケースをカバーする EARS（Easy Approach to Requirements Syntax）記法の受け入れ基準が含まれます。これによりプロンプトの前提が明示的になり、Kiro が求めているものを構築していることがわかります。 Kiro の要件仕様 2. 要件に基づく技術設計 Kiro はコードベースと承認された仕様要件を分析して設計文書を生成します。データフロー図、TypeScript インターフェース、データベーススキーマ、API エンドポイントを作成します。例えば、レビューシステムの Review インターフェースなどです。これにより、通常開発を遅らせる要件の明確化に関する長いやり取りが不要になります。 Kiro のインターフェース、マーメイド図、データフロー図を含む設計仕様 3. タスクの実装 Kiro はタスクとサブタスクを生成し、依存関係に基づいて正しく順序付けし、各タスクを要件にリンクします。各タスクには、単体テスト、統合テスト、ローディング状態、モバイル対応、アクセシビリティ",
    "extracted_at": "2025-07-21T15:38:46+09:00"
  },
  "cached_at": "2025-07-21T15:38:46+09:00"
}