{
  "url": "https://zenn.dev/omegamaster/articles/kiro-cursor-diference",
  "content": {
    "text": "新エディタのkiroとcursorを比較してみたんじゃ Zenn オメガマスター 👻 新エディタのkiroとcursorを比較してみたんじゃ 2025/07/17 に公開 2025/07/23 AI Cursor ai駆動開発 Kiro tech はじめに 気が早いかもしれませんが、そろそろ梅雨も終わり、夏も本番を迎えてきましたね〜 さてAWSから新しいエディタのkiroがプレビュー版でリリースされました！ 早速見ていきながら、cursorと比較してみましょう〜 ! この記事は2025/07/17までの情報です。 細真の情報は公式ドキュメントを必ず参照してください。 結論 まだプレビュー版なので、これからどんどん情報が追加されていくと思うので、要チェックや！（とあるバスケ漫画の控え選手風） claude codeとkiroの併用が強いかもその場合、もしかしたらkiroが無料で使用できるかも？ 必ず実行されるAgent Hooksは.cursor/rulesより遥かに強力！ そもそもkiroって？ IDE内蔵型のAIコーディングエージェントです。Kiroの特徴は他のエディタにもあるVibe(バイブコーディング)だけでなく、Spec（要件定義・設計を先にやる）を使用することで要件定義・設計からコード生成を行なってくれます。 もうやることが決まっていて、コードだけ作って欲しいならVibeモードで、これから何か作るという方はSpecで要件・設計を決めてから実装の方がより実務に近くなるので、万人におすすめです。 https://kiro.dev/index 初期セットアップは画像が多くなるので、まず何ができるのか、どんな感じなのかみてきましょう〜 触ってみよう ! あくまでkiroはまだプレビュー版ということをお忘れなく！ これしか出来ないのか〜ではなく、プレビューでここまでできるんだ〜という観点で見ていきましょう！ ターミナルで開発用フォルダに移動し、 npx create-next-app を実行します。（ここは好きな言語やフレームワークを使用してください） もろもろ終わった後に cd でフォルダに移動して kiro . で起動させます。下記の画像が表示されるので、信用してあげてください。信頼すると2枚目の画像の画面に遷移します。 現在はモデルがsonnet3.7とsonnet4しか選択できませんが、モデルは今後追加されていくと思うので待ちましょう。大丈夫、彼女待つ時間よりは短いと思いますよ… AutoPilotをオンにすると承認なしでどんどん実装をしていきますが、フォルダを消される恐れがあるので、一旦オフにすることをおすすめします。 Specに下記のようにお願いしました。 ToDoリストを作成したい。バックエンドとDBの選定は任せます。 その後.kiro/specs/todo-list/requirements.mdが作成され、要件が適切か聞いてきます。もし要件に変更があれば手修正でもkiroにお願いして修正でも大丈夫です。 kiro作成の要件定義内容 要件定義書 概要 ユーザーがタスクを管理できるToDoリストアプリケーションです。タスクの作成、編集、削除、完了状態の管理を行い、効率的なタスク管理を支援します。 要件 要件1 ユーザーストーリー: ユーザーとして、新しいタスクを作成したい。そうすることで、やるべきことを記録できる。 受け入れ基準 WHEN ユーザーがタスク作成フォームにタイトルを入力し送信ボタンを押す THEN システムは新しいタスクを作成し、タスクリストに表示する WHEN ユーザーが空のタイトルでタスクを作成しようとする THEN システムはエラーメッセージを表示し、タスクを作成しない WHEN ユーザーがタスクを作成する THEN システムはタスクに一意のIDと作成日時を自動で割り当てる 要件2 ユーザーストーリー: ユーザーとして、作成したタスクの一覧を見たい。そうすることで、現在のタスク状況を把握できる。 受け入れ基準 WHEN ユーザーがアプリケーションにアクセスする THEN システムは全てのタスクをリスト形式で表示する WHEN タスクリストが表示される THEN システムは各タスクのタイトル、作成日時、完了状態を表示する WHEN タスクが存在しない THEN システムは「タスクがありません」というメッセージを表示する 要件3 ユーザーストーリー: ユーザーとして、タスクを完了済みにマークしたい。そうすることで、完了したタスクを区別できる。 受け入れ基準 WHEN ユーザーが未完了のタスクのチェックボックスをクリックする THEN システムはそのタスクを完了済みとしてマークする WHEN ユーザーが完了済みのタスクのチェックボックスをクリックする THEN システムはそのタスクを未完了に戻す WHEN タスクが完了済みになる THEN システムはタスクのタイトルに取り消し線を表示する 要件4 ユーザーストーリー: ユーザーとして、不要になったタスクを削除したい。そうすることで、タスクリストを整理できる。 受け入れ基準 WHEN ユーザーがタスクの削除ボタンをクリックする THEN システムは確認ダイアログを表示する WHEN ユーザーが削除を確認する THEN システムはタスクを完全に削除し、タスクリストから除去する WHEN ユーザーが削除をキャンセルする THEN システムはタスクを削除せず、元の状態を維持する 要件5 ユーザーストーリー: ユーザーとして、タスクの内容を編集したい。そうすることで、タスクの詳細を更新できる。 受け入れ基準 WHEN ユーザーがタスクのタイトルをクリックする THEN システムはインライン編集モードに切り替える WHEN ユーザーが編集を完了しEnterキーを押すかフォーカスを外す THEN システムはタスクのタイトルを更新する WHEN ユーザーがEscキーを押す THEN システムは編集をキャンセルし、元のタイトルに戻す IF ユーザーが空のタイトルで更新しようとする THEN システムはエラーメッセージを表示し、更新を拒否する 要件6 ユーザーストーリー: ユーザーとして、タスクをフィルタリングしたい。そうすることで、特定の状態のタスクのみを表示できる。 受け入れ基準 WHEN ユーザーが「全て」フィルターを選択する THEN システムは全てのタスクを表示する WHEN ユーザーが「未完了」フィルターを選択する THEN システムは未完了のタスクのみを表示する WHEN ユーザーが「完了済み」フィルターを選択する THEN システムは完了済みのタスクのみを表示する 問題なかったので、「適切です」と送ったら下記の画像のようになりました。 どのファイルを読み込んでいるかわかるのが良いですね〜cursorには無いんじゃないかな？（あったらごめんなさい） kiro作成の設計書 設計書 概要 Next.js App Routerを使用したフルスタックToDoリストアプリケーション。フロントエンドはReact 19とTailwi",
    "extracted_at": "2025-07-28T16:51:15+09:00"
  },
  "cached_at": "2025-07-28T16:51:15+09:00"
}