{
  "url": "https://zenn.dev/ubie_dev/articles/kiro-claude-code",
  "content": {
    "text": "KiroとClaude Codeの組み合わせで開発の質と速度を両取りできた Zenn Ubie テックブログ Ubie テックブログ Publicationへの投稿 🐣 KiroとClaude Codeの組み合わせで開発の質と速度を両取りできた 鹿野 壮 2025/07/16 に公開 2025/07/19 AI Claude Claude Code Kiro tech Kiroは対話形式で詳細な要件書・設計書を作れるが、実装速度が遅い Claude Codeは爆速開発ができるが、正確な指示出しが難しい 2つの長所を組み合わせることで、質と速度の両取りができました。 Kiroで作った仕様書をClaude Codeに読み込ませたら、Claude Codeがタスクを理解して最後まで実装してくれました。 https://x.com/tonkotsuboy_com/status/1945410412016816322 Kiroとは Kiroとは2025年7月15日にAmazonがリリースした統合開発環境で、要件定義・設計からコードの開発までを行ってくれます。対話形式で詳細なrequirements（機能要件）・design（設計）・tasks（タスクリスト）を作成できます。作られたタスクを実行することで、開発が完了します。 詳しくは次の記事がわかりやすいです。 https://zenn.dev/sesere/articles/31d4b460c949e5 https://kiro.dev/blog/introducing-kiro/ Kiroは設計は得意だが、実装速度が遅い Kiroは高機能な要件定義・設計機能は持っていますが、現時点では実装速度が遅いです。今開発の現場で標準的に使われているClaude Codeは、実装速度が高速です。一方で、曖昧な指示だと手戻りが発生しがちで、詳細な仕様がないと期待と異なる実装になる傾向があります。また、長い会話の中では初期の内容を忘れることもしばしばあります。 であれば、Kiroの要件定義・設計機能とClaude Codeの実装速度を組み合わせれば、詳細な設計書を元にした期待値どおりの高速な開発ができるのではないかと思いました。 また、Kiro自体は魅力なのですが、Claude Codeで築き上げた開発環境（速度・コードの品質・MCPをはじめとする周辺ツール・hooksやカスタムスラッシュコマンドなどの豊富な機能）を手放したくなく、Claude Codeは使い続けたいと考えていたことも、今回の組み合わせに至った理由でもあります。 Kiroの遅さに耐えられない弊社メンバーたち 実際にプロジェクトで試してみた 実際に、簡単な太陽系シミュレータを作りながら、KiroとClaude Codeの組み合わせの検証を行いました。 1. 要件書（requirements.md）の作成 Kiroに次のように呼びかけます。 「太陽系の惑星の公転をシミュレーションできるツールを作りたい。3D表現で。各惑星をクリックすると、その惑星の情報が表示される形にして。」 Kiroが要件書をrequirements.mdとして作成します。 実際に作られた要件書は次のとおりです。気に入らないところがあれば、対話しながら修正できます。 実際に作成された要件書（クリックで展開） # 要件文書 ## 概要 太陽系の惑星の公転を3Dで視覚化し、インタラクティブに探索できるシミュレーションツールです。ユーザーは惑星をクリックして詳細情報を表示でき、リアルタイムで公転運動を観察できます。 ## 要件 ### 要件 1 ** ユーザーストーリー: ** 教育者として、太陽系の惑星の公転運動を3Dで視覚化したいので、学生に天体の動きを直感的に理解してもらえる #### 受入基準 1. WHEN アプリケーションが起動される THEN システムは太陽系の3D表現を表示する SHALL 2. WHEN 3D表示が読み込まれる THEN システムは太陽、水星、金星、地球、火星、木星、土星、天王星、海王星を正確な相対位置に配置する SHALL 3. WHEN シミュレーションが開始される THEN システムは各惑星を実際の公転周期に基づいた相対速度で公転させる SHALL ### 要件 2 ** ユーザーストーリー: ** ユーザーとして、惑星をクリックして詳細情報を見たいので、各天体について学習できる #### 受入基準 1. WHEN ユーザーが惑星をクリックする THEN システムは選択された惑星の詳細情報パネルを表示する SHALL 2. WHEN 詳細情報パネルが表示される THEN システムは惑星名、直径、質量、公転周期、自転周期、太陽からの距離を表示する SHALL 3. WHEN ユーザーが情報パネル外をクリックする THEN システムは詳細情報パネルを閉じる SHALL ### 要件 3 ** ユーザーストーリー: ** ユーザーとして、3D空間を自由に操作したいので、異なる角度から太陽系を観察できる #### 受入基準 1. WHEN ユーザーがマウスをドラッグする THEN システムはカメラの視点を回転させる SHALL 2. WHEN ユーザーがマウスホイールを操作する THEN システムはズームイン・ズームアウトを実行する SHALL 3. WHEN ユーザーが右クリックドラッグする THEN システムはカメラの位置をパンする SHALL ### 要件 4 ** ユーザーストーリー: ** ユーザーとして、シミュレーションの速度を制御したいので、観察に適したペースで惑星の動きを見られる #### 受入基準 1. WHEN ユーザーが再生/一時停止ボタンをクリックする THEN システムはシミュレーションを開始または停止する SHALL 2. WHEN ユーザーが速度スライダーを調整する THEN システムは公転速度を0.1倍から10倍の範囲で変更する SHALL 3. WHEN ユーザーがリセットボタンをクリックする THEN システムは全ての惑星を初期位置に戻す SHALL ### 要件 5 ** ユーザーストーリー: ** ユーザーとして、視覚的に美しい表現を見たいので、学習体験を向上させられる #### 受入基準 1. WHEN 3Dシーンが描画される THEN システムは各惑星に実際の色と質感に近いテクスチャを適用する SHALL 2. WHEN 太陽が表示される THEN システムは発光効果を適用して光源として表現する SHALL 3. WHEN 惑星が公転する THEN システムは軌道の軌跡を薄い線で表示する SHALL 4. WHEN シーンが描画される THEN システムは星空の背景を表示する SHALL ### 要件 6 ** ユーザーストーリー: ** ユーザーとして、レスポンシブなWebアプリケーションを使いたいので、様々なデバイスで利用できる #### 受入基準 1. WHEN アプリケーションがデスクトップブラウザで開かれる THEN システムは全機能を提供する SHA",
    "extracted_at": "2025-07-28T23:19:01+09:00"
  },
  "cached_at": "2025-07-28T23:19:01+09:00"
}