{
  "url": "https://qiita.com/ryu-ki/items/b7d3ea320a872a1631bc",
  "content": {
    "text": "【Kiro】Kiro(要件定義) × Claude Code(実装) で役割分担させてみる #AWS - Qiita search search Search Login Signup search Trend Question Official Event Official Column open_in_new Organization 68 Go to list of users who liked 63 Share on X(Twitter) Share on Facebook Add to Hatena Bookmark more_horiz Delete article close Deleted articles cannot be recovered. Draft of this article would be also deleted. Are you sure you want to delete this article? Cancel Delete delete AI・機械学習 Qiita Tech Festa 2025 Qiita Tech Festa 2025 2025年7月15日まで開催中！ @ ryu-ki in TIS株式会社 【Kiro】Kiro(要件定義) × Claude Code(実装) で役割分担させてみる AWS 初心者 やってみた ClaudeCode Kiro Last updated at 2025-07-15 Posted at 2025-07-15 はじめに 私は現在Claude Code（Proプラン）をWSL2環境で使って開発を行っており、快適に開発をすることができています。本日（2025年7月15日）プレビュー版が提供開始された、AWS発の新しいAI IDE「Kiro」の評判を聞き、特に要件定義周りの機能（Spec）が優れているとのことで注目しています。 そこで今回は、Windows環境にKiroをインストールし、WSL2で動作しているClaude Codeと連携させることで、要件定義はKiroの得意分野に任せ、実装は慣れ親しんだClaude Codeを使うという「いいとこ取り」の開発フローを検証してみることにしました。 環境構成 現在の開発環境 Windows 11 ├── Kiro IDE (Windows版をインストール) └── WSL2 (Ubuntu) ├── Claude Code (既にインストール済み) └── 開発プロジェクト やりたいことの簡単なイメージ # 1. Kiroで要件定義とスペック作成 # Kiroのチャット機能で要件を伝える \"ユーザー認証機能を持つTodoアプリを作りたい\" # 2. Kiroが自動生成 - requirements.md ( 要件定義書 ) - design.md ( 技術設計書 ) - tasks.md ( タスクリスト ) # 3. Kiroの統合ターミナルでClaude Codeを起動 $ claude # 4. スペックをClaude Codeに渡して実装 $ claude \"design.mdに基づいてAPIを実装してください\" セットアップ 1. Kiroのインストール（Windows） 以下から取得することができます。 とりあえずGoogleアカウントを使います。 2. KiroでWSL2プロジェクトを開く とりあえず、WSL2にはつながり、Claude Codeを使うこともできそうに見えます。 以下の記事を参考にさせていただきました。ありがとうございます。 Specを体験 とりあえずSpecを選択し、プロンプトを投げてどのよう感じになるか見てみましょう。今回はQRコードを生成するWebアプリを作ってみてもらいます。 0. 投げたプロンプト QRコードを生成してくれるWebアプリを作りたい。 とりあえず、最初はシンプルな設計にしたい。 1. Requirements プロンプトを渡すと、以下のようにまずは requirements.md が生成されました。こちらで要件定義を実施しています。 読んでみると、ユーザーストーリーとその受け入れ基準が書かれています。 また、受け入れ基準は以下のように書かれています。 #### 受け入れ基準 1. WHEN ユーザーがテキスト入力フィールドにテキストを入力する THEN システムは入力されたテキストを受け取る SHALL 2. WHEN ユーザーが「QRコード生成」ボタンをクリックする THEN システムは入力されたテキストからQRコードを生成する SHALL 3. WHEN QRコードが生成される THEN システムはQRコード画像をWebページ上に表示する SHALL 4. IF 入力フィールドが空の場合 THEN システムはエラーメッセージを表示する SHALL 2. Design 要件定義を承認すると次は design.md を生成します。こちらは、設計書ですね。 アーキテクチャやモジュール、データモデル、エラーハンドリングなどについて記載されています。 3. Task list 設計が承認されると、次は tasks.md が生成されます。こちらには、実装計画が記載されています。 それぞれのタスクには、対応する要件も記載されていてわかりやすいですね。 Specでできたドキュメント 以下のような形で3つのドキュメントが生成されました。 kiro \\s pecs \\q r-code-generator ├── requirements.md ├── design.md └── tasks.md Specで作成されたタスクを実行していく tasks.md の Start task をクリックすることで各タスクを実行することができます。 タスク実行ごとに新しいセッションが作成されるようです。 実際にクリックするとこんな感じになります。 おまかんかもしれませんが、すごく改行されていますね… （タスクはちゃんと進められている模様） 右上に Update tasks があるので随時更新をかけてもよいかもしれません。 更新をかけると勝手にTask3が起動しました… このあたりの挙動は不安定かもしれません。 Claude Codeに実装してもらう 以下のようにお願いすると、アプリをゴリゴリ作ってくれました。（少しエラーはありましたが） Hookを利用してみる 以下の画像のように、KiroではHooksを自然言語から作成してくれるようです。今回は以下のようなHookを作ってみました。（WSL環境により動作確認で引っかかる可能性があるのでいったんしないようにお願いしています） Spec機能でドキュメントが完成したら、そのドキュメント群（.kiro/specs/hoge）を参照して、 `claude .kiro/specs/hogeにあるドキュメントをもとに実装して。動作確認は不要です。 --dangerously-skip-permissions` を実行する また、作成されたHookは以下のように、 .kiro/hooks 配下に置",
    "extracted_at": "2025-07-28T23:19:01+09:00"
  },
  "cached_at": "2025-07-28T23:19:01+09:00"
}