{
  "url": "https://zenn.dev/nogu66/articles/claudecodeui",
  "content": {
    "text": "【徹底解説】Claude Code UI と Cloudflare Tunnelでスマホから快適にAIコーディング nogu 🚀 【徹底解説】Claude Code UI と Cloudflare Tunnelでスマホから快適にAIコーディング 2025/08/30 に公開 AI Cloudflare Claude Claude Code zennfes2025ai tech はじめに 先日、X（旧Twitter）を眺めていたところ、私の開発スタイルを根底から揺るすぶる、衝撃的な投稿が目に飛び込んできました。 https://x.com/masa_oka108/status/1960832969217859847 それは、 スマホからClaude Codeを使う方法 という投稿でした。単なるテキストエディタではなく、ローカルPC環境で動作するAIコーディングアシスタントを、どこからでも自在に操る―。その手法を、私は「この環境を自分のものにしたい」と強く思わされました。 その投稿がきっかけで出会ったのが、本記事で紹介する Claude Code UI と Cloudflare Tunnel の組み合わせです。 Claude Code は、 Anthropic 社が開発した強力なAIアシスタントですが、本来はPCのターミナル操作が必須でした。しかし、 Claude Code UI がその常識を覆し、ブラウザ上で直感的に操作できるGUIを提供します。 さらに、 Cloudflare Tunnel を使えば、そのパワフルな環境を、外出先のスマートフォンからでも安全に呼び出すことが可能になります。 この記事では、私が衝撃を受けた環境を、誰もが手に入れられるように、その具体的な手順を丁寧に解説します。 対象読者 Claude Code を利用しているが、ターミナル操作が少し面倒だと感じている方 AIコーディングツールを、より直感的なUIで操作したい開発者 外出先や移動中に、スマートフォンやタブレットでコーディング作業をしたい方 Cloudflare Tunnel を使ったセキュアなリモートアクセス環境に興味がある方 記事のスコープ この記事では、 Claude Code UI のセットアップ方法から、 Cloudflare Tunnel を用いて外部からアクセスする手順までを、丁寧に解説します。 TaskMaster AI との連携など、より高度な機能については触れません。 課題：CLIベースのAIツール操作の限界 Claude Code や Cursor CLI は非常に強力なAIコーディングアシスタントですが、すべての操作がコマンドライン上で行われるため、開発フローにおいていくつかの非効率な点がありました。 What : ターミナル上で過去の対話履歴を追いかけるのは困難です。 Why : スクロールバックには限界があり、特定のやり取りを見つけるためには grep など別のツールを駆使する必要がありました。 How : 結果として、以前のコンテキストを再利用したくても、簡単にはできず思考が中断されがちでした。 What : コードファイルを参照・編集しながらAIと対話する際、ターミナルとエディタを行き来する必要があります。 Why : これにより、コンテキストスイッチのコストが発生し、集中力が削がれます。 How : 特に、AIが生成したコードスニペットをプロジェクトの複数ファイルに適用するような場合、この行き来は非常に煩雑になります。 これらの課題を解決し、AIとの対話を開発ワークフローにシームレスに統合するのが Claude Code UI です。 解決策：Claude Code UIによる開発体験の向上 Claude Code UI は、Claude CodeおよびCursor CLI用のデスクトップおよびモバイル UI です。ローカルまたはリモートから使用して、Claude Code または Cursor でアクティブなプロジェクトやセッションを表示し、どこからでも（モバイルまたはデスクトップ）変更を加えることができます。これにより、どこでも動作する適切なインターフェースが実現します。Claude Sonnet 4、Opus 4.1、GPT-5などのモデルをサポートしています。 https://github.com/siteboon/claudecodeui 主な特徴（詳細解説） 1. レスポンシブデザイン What : デスクトップ、スマホ、タブレットなど、あらゆるデバイスの画面サイズに最適化されたUIを提供します。 Why : これにより、PCでの本格的な開発作業中はもちろん、移動中にスマートフォンで少しアイデアを試したり、タブレットでコードレビューをしたりといった、柔軟な働き方が可能になります。 How : ブラウザでアクセスするだけで、特別なアプリをインストールすることなく、どのデバイスでも一貫した操作性を得られます。 2. インタラクティブなチャット What : 使い慣れたチャットアプリのようなUIで、AIとの対話をスムーズに行えます。 Why : CLIでの一行ずつのやり取りとは異なり、会話の流れ全体を視覚的に把握できます。これにより、複雑な問題解決の際にも思考を整理しやすくなります。 How : チャット履歴は自動で保存され、いつでも過去の対話を参照できます。コードブロックはシンタックスハイライト付きで表示され、ワンクリックでコピーできます。 3. ファイルとGitの統合 What : UI内に、シンタックスハイライト付きのファイルエクスプローラーと、Gitの差分表示やコミットが可能なGitエクスプローラーを搭載しています。 Why : AIにプロジェクト全体のコードを読み込ませて質問したり、生成されたコードを直接ファイルに書き込んだり、そのままGitでバージョン管理したり、といった一連の作業がUI内で完結します。エディタとターミナルを往復する必要はもうありません。 How : 左側のパネルでファイルツリーをブラウズし、ファイルをクリックして内容をチャットに送りAIにコンテキストを伝えます。AIの提案を編集し、保存。その後Gitパネルに切り替え、変更内容を確認してコミットメッセージを書き込み、コミットを実行します。 4. セッション管理 What : 複数の対話セッションを管理し、簡単に切り替えたり再開したりできます。 Why : プロジェクトごとや、解決したい課題ごとにセッションを分けることで、コンテキストが混ざるのを防ぎます。「あの機能についてAIと相談した履歴はどこだっけ？」と探す手間がなくなります。 How : 新しいチャットを開始すると新しいセッションが作られ、過去のセッションはリストから選択するだけでいつでもその時の状態に戻ることができます。 具体的な導入手順 前提条件 Node.js v20以上 Claude Code または Cursor CLI がインストールされ、設定済みであること セットアップ リポジトリをクローン git clone https://g",
    "extracted_at": "2025-09-30T10:36:18+09:00"
  },
  "cached_at": "2025-09-30T10:36:18+09:00"
}