{
  "url": "https://japan.zdnet.com/article/35235511/",
  "content": {
    "text": "Anthropicの「Claude」、外部アプリや外部サイトとの連携が可能に - ZDNET Japan Continue to ZDNET Japan 特集 海外発 業界DX 製造 流通 教育 CIO/経営 ITインフラ セキュリティ クラウド データマネジメント ソフトウェア Special 広告特集：新しいセキュリティのカタチ 読者調査 2025：「働く場所の自由」と「Wi-Fiリスク」 新着まとめ：製造業に立ちはだかるAIの壁 ZDNET United States ZDNET France ZDNET Germany ZDNET Korea Go --> Go 新規登録 ログイン FAQ My ページ ログアウト FAQ マーケティング クライアント オフトピ アーカイブ 特集 海外発 業界DX 製造 流通 教育 CIO/経営 ITインフラ セキュリティ クラウド データマネジメント マーケティング ソフトウェア クライアント オフトピ アーカイブ 広告特集：新しいセキュリティのカタチ ZDNET Japan ソフトウェア Anthropicの「Claude」、外部アプリや外部サイトとの連携が可能に Webb Wright&nbsp;（Special to ZDNET.com）&nbsp;翻訳校正：&nbsp;佐藤卓&nbsp;吉武稔夫&nbsp;（ガリレオ） 2025-07-15 09:36 シェア Tweet noteで書く 印刷する メールで送る テキスト HTML 電子書籍 PDF ダウンロード テキスト 電子書籍 PDF クリップした記事をMyページから読むことができます Here's my content 　生成人工知能（AI）「Claude」の開発元であるAIスタートアップのAnthropicは米国時間7月14日、Claudeがサードパーティー製のアプリやウェブサイトのディレクトリーと直接連携し、情報を抽出できるようになったと発表した。その対象には、「Stripe」「Figma」「Prisma」「Canva」「Asana」などが含まれる。この機能の狙いは、Claudeの出力結果に含まれる情報を外部サービスに転送したり、外部サービスから情報を取り込んだりするといった、通常なら時間のかかる作業をスピードアップすることだ。 　「Claudeが、ユーザーと同じツール、データ、コンテキストにアクセスできるようになった。これにより、Claudeは便利なアシスタントから情報に通じたAIコラボレーターへと変わり、より関連性の高い応答を返したり、ツール内でユーザーと直接連携したりできるようになる」と、Anthropicは14日に発表したプレスリリースで述べている。 その仕組みは？ 　この新しいディレクトリーには、さまざまなウェブサイトやデスクトップ拡張機能へのリンクである「コネクタ」が登録されている。これらは、Claudeがデータにアクセスして新しいプロジェクトに組み込むためのデジタルゲートウェイのようなものだ。 　例えば、会社の売上データをStripeから取得し、分かりやすい四半期レポートとしてまとめるようClaudeに指示すれば、AIが生成したテンプレートに手作業でデータを転記する作業が不要になる。また、プロジェクトマネージャーなら、チームミーティング後にAsanaのワークフローを更新する必要がある場合に、Appleの「メモ」アプリのドキュメントからすべての関連情報を参照して抽出するよう指示できる。同様に、製品開発者は「Linear」からメモを抽出してバグ修正の進捗状況を追跡するよう指示でき、グラフィックデザイナーも、Canvaでデザインを作成するよう簡単に指示できる。 　Canvaのエコシステム責任者であるAnwar Haneef氏は声明の中で次のように述べている。「Claudeは数百万人の人々にとって不可欠なクリエイティブパートナーとして急成長しており、今回の連携機能により、Canvaのすべてのデザイン機能をClaudeのユーザー体験に直接組み込めるようになった」「ユーザーは、アイデアをアップロードしたり手作業で転送したりすることなく、Canvaのデザインを生成、要約、レビュー、公開する作業を、すべてClaudeのチャット内で行えるようになる」 利用方法 　Claudeの新しいディレクトリーは、すべてのウェブユーザーとデスクトップユーザーが利用できる。 こちら からディレクトリーにアクセスして、サードパーティーの作業データへのアクセスを許可しよう。 提供：CFOTO / Contributor/Getty この記事は海外Ziff Davis発の 記事 を朝日インタラクティブが日本向けに編集したものです。 ZDNET Japan 記事を毎朝メールでまとめ読み（登録無料） メールマガジン登録のお申し込み シェア Tweet noteで書く 関連記事 ソフトウェアテスト自動化におけるAI活用の5つのトレンド 「Googleスプレッドシート」、AI関数を導入--セルにプロンプトを直接入力 宮城県の石巻赤十字病院、院内の医療機器やIT機器をIT部門で一元管理化 「KDE Plasma 6.4」レビュー--4つの重要な機能強化を含む最新のLinuxデスクトップ環境 Anthropic、「Claude」でAIアプリを構築・共有可能に--「Artifacts」機能を強化 Anthropic、日本進出を発表--Claude日本語版をリリース Anthropic、「Claude Code」を任意のMCPサーバーと連携可能に Anthropic、コーディング支援ツール「Claude Code」を「Pro」プランに投入 Anthropic、「Claude Pro」プランに「Research」「Integrations」機能を追加 特集 さまざまなLinuxディストリビューションの世界 松岡功の「今週の明言」 カーボンニュートラル（脱炭素） トップインタビュー 松岡功の一言もの申す Linuxノウハウ 「GIGAスクール構想」で進化する教育現場 デジタルジャーニーの歩き方 DMARC導入待ったなし！ PDF Report at ZDNET Japan パスキー徹底解説：パスワードレスな未来への完全ガイド 持続可能な地域社会を目指す「地域DX」 ビジネスアジリティー向上：ビジネスのスピードアップを図ろう 流通テック最前線 デジタル岡目八目 ICT来し方行く末 トランスフォーメーションの破壊者：インテントAI 中国ビジネス四方山話 Ziddyちゃんの「私を社食に連れてって」 「ひとり情シス」の本当のところ DXで直面するカベを突破せよ D＆Iで切り開く、企業の可能性 ビジネス視点で分かるサイバーのリスクとセキュリティ 技術者視点で見るメインフレームの進化と深化 世界のICTが集まるアイルランド 「働く」を変える、HRテックの今 CIO・情シス部長が知っておきたい「データクラウド」の基本と構造 企業セキュリティの歩き方 対応必須化の波が到来したSBOM動向 サプライチェーン管理高度化のススメ CNET Ja",
    "extracted_at": "2025-07-21T15:38:56+09:00"
  },
  "cached_at": "2025-07-21T15:38:56+09:00"
}