{
  "url": "https://zenn.dev/galirage/articles/aws-ai-native-kiro",
  "content": {
    "text": "最新のAI駆動開発ツール「Kiro」を徹底解説!! Zenn Galirage Inc. Galirage Inc. Publication Pro 👻 最新のAI駆動開発ツール「Kiro」を徹底解説!! ますみ / 生成AIエンジニア 2025/07/17 に公開 AWS 生成 AI ai駆動開発 Kiro tech はじめまして、ますみです！ 株式会社Galirage（ガリレージ） という「生成AIに特化して、システム開発・アドバイザリー支援・研修支援をしているIT企業」で、代表をしております^^ この記事では、2025年7月15日に発表された、最新のAI駆動開発ツール「Kiro」について解説します！ AI駆動開発ツール（AIネイティブ開発ツール）について、まだ詳しくない方は、下記の記事をご覧ください^^ https://zenn.dev/umi_mori/books/ai-native-programming/viewer/what_is_ai_native_programming Kiroとは？ Kiroとは、AWSが開発した GitHub Copilot や Cursor のような「 生成AIを用いたAI駆動開発ツール 」です。 AI駆動開発ツールの中で言うと、生成AIによるAIコードエディターです。 現在は、まだPreview版なため、動作が不安定（よく「 An unexpected error occurred, please retry. 」というエラーが出てくる）ですが、その代わり今なら無料で利用できます！ ! これまでダウンロードができていたのですが、Waitlistに切り替わりました（2025年7月17日現在）。 Kiroの特徴 Kiroの持つ一番の特徴は、「Spec」というモードがあることです。 Specでは、次の3つのプロセスを経て、システムを開発していきます。 Requirements ：要件定義 Design ：設計 Task list ：タスク整理 公式サイトでは、「 Spec-driven Development（仕様駆動開発） 」によるAIコーディングと打ち出しています。 ただ、要件定義では、以下のように「ユーザーストーリー」や「WHEN-THEN」のフォーマットで受け入れ条件が記述されているため、どちらかというと「 Behavior-driven Development（振る舞い駆動開発 / ビヘイビア駆動開発） 」という開発プロセスの方が近い発想かなという感じですね。 ### Requirement 1 ** User Story: ** As a user, I want to add new tasks to my TODO list, so that I can keep track of things I need to do. #### Acceptance Criteria 1. WHEN the user enters a task description and submits it THEN the system SHALL add the task to the TODO list 2. WHEN the user submits an empty task description THEN the system SHALL display an error message and not add the task 3. WHEN a task is successfully added THEN the system SHALL clear the input field and display the new task in the list ! ビヘイビア駆動開発とは、「どのように動くべきか？」という振る舞いに焦点を当てて、開発とテストを進める開発プロセスです。 代表的な書き方として、「 Given-When-Then 」フォーマットがあります。 Given（前提）：お金が投入されている When（操作）：飲み物のボタンを押す Then（結果）：飲み物が出てくる 下記のように、ユーザー目線でのシナリオ（仕様）を整理した上で、このドキュメントに沿って、設計・開発が進みます。 また、もう一つのマイナーな違いとして、「 タスクキュー機能 」があります。 AIエージェントの種別として、協調型や自己駆動型など様々なものがありますが、その中における1つのポイントは「 非同期で処理をするかどうか 」です。 Kiroでは、同期処理をする必要がある工程において、以下のようにタスクをキューイングできます。 Kiroのインストール方法 Kiroは、以下のサイトからダウンロードできます👇 https://kiro.dev/ そして、なんとも可愛いアイコンですね 😊 Kiroのセットアップ方法 インストールが完了したら、以下の画像の通り、セットアップをしていきます。 今回は、GitHubでログインしていきます。 VS Codeのプラグインもインポートできます。 テーマも選べます。 どうたら、 code や cursor のように、コマンドでエディターを開くことができます。 無事、パスが通りましたね！ 最後に、プロジェクトを開きます。 以下の画面までたどり着いたら、セットアップは完了です！ KiroによるAI駆動開発のデモンストレーション Kiroには、「Vibe」と「Spec」の二つの始め方があります。 Vibe：チャットによって、ノリで開発を始めるスタイル Spec：要件や設計をしっかり固めてから開発を始めるスタイル それぞれ以下のような特徴があります。 項目 Vibe Spec 概要 チャットによって、ノリで開発を始めるスタイル 要件や設計をしっかり固めてから開発を始めるスタイル オススメのシナリオ ・素早くアイデアを試したいとき ・要件がまだはっきりしていないとき ・特定のタスクを実装したいとき ・機能をじっくり深く考えたいとき ・事前にしっかり計画が必要なプロジェクト ・構造的に機能を作りたいとき 「Vibe」のデモンストレーション ここでは、以下のようなプロンプトでTODOリストを作成してみます。 最低限の機能を持ったTODOリスト。 まずは、Vibeを選択します。 そして、プロンプトを入力します。 すると、GitHub CopilotやCursorのように、コードを生成してくれます！ では、実際に実行するように指示してみましょう！ すると、コマンドが表示されます。 実行すると以下のようにアプリケーションが開きます。 一通りのテストをしたところ、全てうまく動作しました！ 以下のようなプロンプトで、追加の機能実装をしてみましょう。 削除したタスクを確認できるようにしたいです。削除したタスクのリストは、アコーディオンの中に入れたいです。 ちなみに、こんな感じで、Followを押すと、変更箇所を見に行けます。 無事、実装できたようですね。 画面で確認していきましょう。 いずれも想定通りの挙動をしていました！ 「Spec」のデモンストレーション 次",
    "extracted_at": "2025-07-28T23:19:01+09:00"
  },
  "cached_at": "2025-07-28T23:19:01+09:00"
}